import 'package:driving_licence_quiz/Datta/quston_model.dart';

// 42 ,30
List<Qusittionmodel> P3qusttion4 = [
  Qusittionmodel(
      ' کدامیک از موارد زیر جز قطعات موتور خودرو محسوب نمی شود؟', //titels
      {
        'شاتون': false, //quizes
        'سیلندر': false,
        'فلایویل': false,
        'لنت': true,
      },
      'images/p1images5/2.jpg'), //images

  Qusittionmodel(
      'در صورت نقص در قسمت صافی هوا یا فیلتر هوای موتور کدام قسمت یا قسمت های خودرو دچار نقص می شود؟ ',
      //titels
      {
        'اجزای داخلی موتور': false, //quizes
        'سیستم برق و هیدرولیک': false,
        'مصرف سوخت و افزایش آلایندگی': false,
        'موارد یک و سه': true,
      },
      'images/p1images5/3.jpg'), //images

  Qusittionmodel(
      ' وظیفه قطعه پروانه در خودرو چیست؟ ', //titels
      {
        'به حرکت در آوردن خودرو': false, //quizes
        'خنک سازی رادیاتور خودرو': true,
        'به حرکت در آوردن میل لنگ': false,
        ' خنک سازی راننده خودرو': false,
      },
      'images/p1images5/4.jpg'), //images

  Qusittionmodel(
      ' نام قطعه مشخص شده در شماتیک ترمز دیسکی چیست؟', //titels
      {
        ' شاتون': false, //quizes
        'سیلندر': false,
        'کالیپر': true,
        'کارتر': false,
      },
      'images/p1images5/5.jpg'), //images

  Qusittionmodel(
      'در موتورهای بنزینی جرقه به صورت ……..و توسط ……..زده میشود. ', //titels
      {
        'مکانیکی - بنزین': false, //quizes
        'دینامیکی - شمعها': false,
        ' الکتریکی - شمعها': true,
        ' الکتریکی - باطری': false,
      },
      'images/p1images5/6.jpg'), //images

  Qusittionmodel(
      ' کدامیک از موارد زیر سیستم انتقال قدرت می باشد؟', //titels
      {
        'پدال کلاج - گیربکس - دیفرانسیل': false, //quizes
        'کلاج - گیربکس - دیفرانسیل': true,
        'گیربکس - دیفرانسیل': false,
        'موتور - گیربکس - کلاج': false,
      },
      'images/p1images5/7.jpg'), //images

  Qusittionmodel(
      'کدامیک جزو وظایف اصلی سیستم اگزوز نیست؟ ', //titels
      {
        'کاهش صدای بالای موتور': false, //quizes
        'کاهش آلایندگی گازهای خروجی از موتور': false,
        'کاهش حرارت تولید شده توسط موتور': true,
        'هدایت گازهای باقی مانده ناشی از عمل احتراق موتور به سمت خارج': false,
      },
      'images/p1images5/8.jpg'), //images

  Qusittionmodel(
      ' شکل بالا نشانگر چیست؟', //titels
      {
        'دور موتور': false, //quizes
        ' سوخت خودرو': false,
        'درجه حرارت آب موتور': true,
        'هیچکدام': false,
      },
      'images/p1images5/9.jpg'), //images
  Qusittionmodel(
      ' به میزان تمیز کنندگی بهتر به منبع آب شیشه شور می توان چه میزان ماده تمیز کننده اضافه کرد؟ ',
      //titels
      {
        'کمتر از 30 درصد': false, //quizes
        'کمتر از 20 درصد': false,
        'کمتر از 10 درصد': false,
        'کمتر از 5 درصد': true,
      },
      'images/p1images5/10.jpg'), //images

  Qusittionmodel(
      'کدام یک به مفهوم «ایست وسیله نقلیه برای هر مدت ممنوع» می باشد؟ ',
      //titels
      {
        'ایستادن': false, //quizes
        'ایستادن ممنوع': true,
        'توقف': false,
        'توقف ممنوع': false,
      },
      'images/p1images5/11.jpg'), //images

  Qusittionmodel(
      'برای راه اندازی خودرو راننده در چه مرحله ای بایستی کمربند ایمنی را ببندد؟ ',
      //titels
      {
        'در حین حرکت': false, //quizes
        'پس از روشن کردن موتور خودرو': true,
        'قبل از روشن کردن موتور خودرو': false,
        'نیازی به بستن کمربند ایمنی نمی باشد': false,
      },
      'images/p1images4/11.jpg'), //images

  Qusittionmodel(
      '  حق تقدم عبور را در تقاطع زیر مشخص کنید.', //titels
      {
        'سواری - کامیون - اتوبوس': false, //quizes
        'اتوبوس - سواری - کامیون': false,
        'کامیون - اتوبوس - سواری': true,
        'کامیون - سواری - اتوبوس': false,
      },
      'images/p1images4/12.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟ ', //titels
      {
        'عبور با ارتفاع 2.4 متر ممنوع': false, //quizes
        'عبور با عرض 2.4 متر ممنوع': false,
        ' عبور با وزن 2.4 تن ممنوع': false,
        'عبور با بار بیش از 2.4 تن بر هر محور ممنوع': true,
      },
      'images/p1images4/13.jpg'), //images

  Qusittionmodel(
      ' در هنگام پارک در سربالایی و در راه بدون جدول،فرمان وسیله نقلیه باید به کدام سمت چرخانده شود؟',
      //titels
      {
        'سمت چپ': false, //quizes
        'سمت راست': true,
        'فرقی ندارد': false,
        'مخالف عقربه ساعت': false,
      },
      'images/p1images4/14.jpg'), //images

  Qusittionmodel(
      '  به مجموعه رفتارهای منفی در رانندگی چه می گویند؟', //titels
      {
        ' رانندگی ایمن': false, //quizes
        'رانندگی خطر ساز و یا رانندگی تهاجمی': true,
        'رانندگی مطمئنه': false,
        'فرهنگ رانندگی': false,
      },
      'images/p1images4/15.jpg'), //images

  Qusittionmodel(
      ' در ارزیابی مصدومین کدامیک از مصدومین را باید در اولیت انجام کمک های اولیه قرار داد؟',
      //titels
      {
        ' مصدومینی که آسیبهای آنها کمتر است.': false, //quizes
        'مصدومینی که آسیبهای آنها بسیار شدید است نظیر سوختگی ها یا زخمهای وسیع':
            true,
        'کودکان در اولیت انجام کمکهای اولیه هستند.': false,
        'مصدومینی که از سن بالاتری دارند نسبت به سایر مصدومین بر خورداند.':
            false,
      },
      'images/p1images4/16.jpg'), //images

  Qusittionmodel(
      'اگر خودرویی با نور بالا از روبرو به شما نزدیک شود چه باید بکنید؟ ',
      //titels
      {
        'سرعت را کاهش داده و سمت راست جاده نگاه کرده و با کنار چشم حرکت خودرو مقابل را تحت نظر داشت.':
            true,
        //quizes
        'باید سرعت را افزایش داده و سریع از کنار آن عبور کرد.': false,
        ' باید با تبدیل نور پایین به نور بالا و بوق ممتد او را متوجه نموده که از نور پایین استفاده کند.':
            false,
        ' باید سرعت را کاهش داده و به سمت جاده نگاه کرد.': false,
      },
      'images/p1images4/17.jpg'), //images
  Qusittionmodel(
      ' کدام یک از موارد زیر جزو رفتار ناهنجار اجتماعی و ناپسند نمی باشد؟',
      //titels
      {
        'نصب بوق های گوش خراش': false, //quizes
        ' استفاده از لامپ های غیر مجاز': false,
        'نصب سیستم های صوتی پر قدرت': false,
        'رانندگی با سرعت مجاز': true,
      },
      'images/p1images4/18.jpg'), //images

  Qusittionmodel(
      ' به منظور جلوگیری از آسیب رسی به بخش های موتور تسمه تایم پس از طی چه مسافتی بایستی تعویض شود؟',
      //titels
      {
        'بین 10 تا 15 هزار کیلومتر': false, //quizes
        'بین 60 تا 90 هزار کیلومتر': true,
        'با هر بار تعویض روغن': false,
        'هر 5 هزار کیلومتر': false,
      },
      'images/p1images4/19.jpg'), //images

  Qusittionmodel(
      'از زمانی که راننده تشخیص می دهد نیاز به توقف دارد تا لحظه به کار گرفتن ترمزها چه نام دارد؟ ',
      //titels
      {
        'زمان واکنش': true, //quizes
        'مسافت توقف': false,
        'مسافت ترمز': false,
        ' زمان ترمز': false,
      },
      'images/p1images4/20.jpg'), //images

  Qusittionmodel(
      ' توقف و یا ایستادن در کدام یک از محل های زیر مجاز است؟', //titels
      {
        ' گذرگاه پیاده': false, //quizes
        ' پیاده رو': false,
        'کنار وسایل نقلیه ای که خود متوقف می باشد': false,
        'محدوده پارک آزاد': true,
      },
      'images/p1images4/21.jpg'), //images

  Qusittionmodel(
      'در کدامیک از موارد زیر بوق زدن مجاز است؟ ', //titels
      {
        'صدا زدن افراد': false, //quizes
        ' اعلام حضور و باز کردن در منزل': false,
        'سبقت مجاز در روز': true,
        ' خداحافظی': false,
      },
      'images/p1images4/22.jpg'), //images

  Qusittionmodel(
      ' حق تقدم عبور را مشخص کنید (آمبولانس در حال ماموریت است)', //titels
      {
        ' 3 - 1 - 2 - 4': false, //quizes
        '1 - 3 - 2 - 4': false,
        '4 - 2 - 1 - 3': false,
        ' 3 - 2 - 4 - 1': true,
      },
      'images/p1images4/23.jpg'), //images

  Qusittionmodel(
      ' کدام مورد نمونه ای از رفتار پر خطر هنگام رانندگی است؟ ', //titels
      {
        ' حرکت بین خطوط': false, //quizes
        'توجه به جلو': false,
        ' استفاده از تلفن همراه': true,
        'عدم رعایت فاصله طولی': false,
      },
      'images/p1images4/24.jpg'), //images

  Qusittionmodel(
      'انجام کدامیک از موارد زیر در هنگام تنفس مصنوعی صحیح تر است؟ ', //titels
      {
        'خارج کردن اجسام خارجی از دهان مصدوم، دادن تنفس مصنوعی، بررسی تنفس حداقل به مدت 20 ثانیه':
            false,
        //quizes
        'خارج کردن اجسام خارجی از دهان مصدوم، بررسی تنفس حداقل به مدت 20 ثانیه، دادن تنفس به مدا 5 ثانیه':
            false,
        'خارج کردن اجسام خارجی از دهان مصدوم، باز کردن راه هوایی با بالا بردن چانه مصدوم، بررسی داشتن تنفس پس از باز بودن راه هوایی':
            true,
        ' باز کردن دهان مصدوم و دادن تنفس مصنوعی، بررسی تنفس به مدت 20 ثانیه ، دادن تنفس مصنوعی با مدت 5 ثانیه':
            false,
      },
      'images/p1images4/25.jpg'), //images

  Qusittionmodel(
      ' مفهوم تابلوی بالا چیست؟', //titels
      {
        'خطر در تقاطع خطوط راه آهن': false, //quizes
        'تقاطع با راه آهن دو خطه': true,
        ' تقاطع خطوط راه آهن': false,
        ' هچیکدام': false,
      },
      'images/p1images4/26.jpg'), //images

  Qusittionmodel(
      ' عنوان کدام یک از تابلوهای بالا راهنمای مسیر می باشد؟', //titels
      {
        ' 1': false, //quizes
        ' 2': false,
        '3': false,
        '2 و 4': true,
      },
      'images/p1images4/27.jpg'), //images
  Qusittionmodel(
      ' وظیفه رانندگان در برخورد با وسیله نقلیه امدادی که دستگاههای خبری و صوتی را به کار انداخته چیست؟',
      //titels
      {
        'در کنار وسیله نقلیه حرکت کنند.': false, //quizes
        ' باید به منتهی الیه سمت راست هدایت و عندالزوم تا گذشتن وسیله نقلیه امدادی توقف کنند.':
            true,
        ' به مسیر خود ادامه دهند.': false,
        'به سمت پچ متمایل شوند.': false,
      },
      'images/p1images4/28.jpg'), //images

  Qusittionmodel(
      ' شما در اتومبیل خود دو کودک دارید چه کسی مسئولیت دارد که کودکان کمربند ایمنی را بسته باشند؟',
      //titels
      {
        'کودکان': false, //quizes
        'والدین بچه ها': false,
        'راننده': true,
        'مسافری که صندلی جلو نشسته': false,
      },
      'images/p1images4/29.jpg'), //images

  Qusittionmodel(
      '  شکل بالا چه موردی را هشدار می دهد؟', //titels
      {
        ' زمانی که شرایط جاده استاندارد نیست و چاله و دست انداز وجود دارد باید احتیاط نمود.':
            true,
        //quizes
        'در شرایطی مانند مه یا ریزش باران که شعاع دید کم است باید با سرعت کمتر از محدوده سرعت قانونی حرکت نمود.':
            false,
        'در شرایطی که در جاده عابر پیاده یا دوچرخه سوار وجود دارد باید سرعت مناسب را انتخاب نمود.':
            false,
        'در نزدیکی مراکز خرید از سرعت خود بکاهید.': false,
      },
      'images/p1images4/30.jpg'), //images
];
