import 'package:driving_licence_quiz/Datta/quston_model.dart';

// 20 ,
List<Qusittionmodel> P2qusttions2 = [
  Qusittionmodel(
      '  کدام گزینه در مورد گردش به چپ در راههای یک طرفه درست است؟', //titels
      {
        'رانندگان موظفند وسیله نقلیه را به منتهی الیه طرف راست خیابان هداست و سپس به چپ گردش کنند.':
            false,
        //quizes
        ' گردش به چپ در خیابان یک طرفه ممنوع است.': false,
        ' رانندگان موظفند وسیله نقلیه را به منتهی الیه طرف چپ خیابان هدایت و سپس به چپ گردش کنند.':
            true,
        'باید منتظر بمانند تا خیابان خلوت شود.': false,
      },
      'images/paye1images2/1.jpg'), //images

  Qusittionmodel(
      'در علائم عبور و مرور راهنما برای مناطق تفریحی و فرهنگی و گردشگری به چه رنگی مشخص شده است؟ ',
      //titels
      {
        ' سبز': false, //quizes
        'قهوه ای': true,
        'زرد': false,
        'نارنجی': false,
      },
      'images/paye1images2/2.jpg'), //images
  Qusittionmodel(
      'حداکثر میزان سرعت در خیابانهای شریانی اصلی چند کیلومتر بر ساعت است؟ ',
      //titels
      {
        '50 کیلومتر بر ساعت': false, //quizes
        '60 کیلومتر در ساعت': true,
        ' 30 کیلومتر در ساعت': false,
        '70 کیلومتر در ساعت': false,
      },
      'images/paye1images2/3.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی شکل بالا چیست؟ ', //titels
      {
        'طول محدوده خطر': false, //quizes
        'افزایش خطوط عبور': true,
        'کاهش خطوط عبور': false,
        ' بسته بودن یکی از خطوط عبور': false,
      },
      'images/paye1images2/4.jpg'), //images

  Qusittionmodel(
      'هر باری که برروی باربند سقف اتومبیل حمل می شود باید؟ ', //titels
      {
        'زمانیکه نیاز باشد حمل شود.': false, //quizes
        'با یک پوشش پلاستیکی پوشیده شود.': false,
        'محکم بسته شود.': true,
        'تا حد امکان سبک باشد.': false,
      },
      'images/paye1images2/5.jpg'), //images

  Qusittionmodel(
      ' مفهوم این تابلو چیست؟', //titels
      {
        'پایان منطقه محدودیت سرعت': false, //quizes
        ' منطقه محدودیت سرعت': false,
        'حداقل سرعت 30 کیلومتر': false,
        'حداکثر سرعت 30 کیلومتر': false,
      },
      'images/paye1images2/6.jpg'), //images

  Qusittionmodel(
      ' خطوط زیگزاگ چیست؟', //titels
      {
        'رنگ این خطوط سبز و به صورت هاشور در حاشیه راههای متصل به پیاده رو کشیده می شود و عبور کردن و ایستادن روی آنها مجاز است.':
            false,
        //quizes
        ' رنگ این خطوط قرمز و به صورت زیگزاگ در حاشیه راههای متصل به پیاده رو کشیده می شود و عبور کردن و ایستادن روی آنها مجاز است.':
            false,
        'رنگ این خطوط زرد و به صورت زیگزاگ در حاشیه راههای متصل به پیاده رو کشیده می شود و عبور کردن و ایستادن روی آنها ممنوع است.':
            true,
        'رنگ این خطوط قهوه ای و به صورت خط ممتد در حاشیه راههای متصل به پیاده رو کشیده می شود و عبور کردن و ایستادن روی آنها ممنوع است.':
            false,
      },
      'images/paye1images2/7.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی تصویر بالا چیست؟ ', //titels
      {
        'پایان شهر': false, //quizes
        'پایان تمام محدودیت ها': false,
        'خیابان اصلی': false,
        ' پایان خیابان اصلی': false,
      },
      'images/paye1images2/8.jpg'), //images

  Qusittionmodel(
      ' برای علامت دادن به منظوره گردش به راست در صورتیکه راهنمای شما خراب باشد دست خود را به کدام حالت باید جهت اطلاع سایر رانندگان حرکت دهید؟ ',
      //titels
      {
        ' دست خود را بیرون برده و بالا پایین می برید.': false, //quizes
        ' دست چپ خود را از بالا به پایپن حرکت دهید.': false,
        'دسته چپ خود را به صورت افقی قرار دهید.': false,
        'دست چپ خود را از آرنج به طرفه بالا خم کنید و به طور عمودی نگه دارید.':
            true,
      },
      'images/paye1images2/9.jpg'), //images

  Qusittionmodel(
      ' رانندگان وسیله نقلیه با دیدن چراغ چشمک زدن زرد در تقاطع و گذر گاه پیاده چه عملی را باید انجام دهند؟',
      //titels
      {
        'باید توقف نموده وپس از اطمینان از نبودن خطر تصادف عبور نمایند.': false,
        //quizes
        'با احتیاط و سرعت کم عبور نمایند.': true,
        'توقف کامل نمایند در صورت نبودن خط ایست در فاصله 5 متری چراغ راهنمایی و رانندگی توقف نمایند.':
            false,
        'گزینه یک و سه درست است.': false,
      },
      'images/paye1images2/10.jpg'), //images

  Qusittionmodel(
      'تابلو به شکل مثلث به معنای تقاطع از کدام نوع تابلوها است؟ ', //titels
      {
        'محلی': false, //quizes
        'آگاهی دهنده یا اخباری': false,
        'بازدارنده یا انتظامی': false,
        'هشدار دهنده یا اخطاری': true,
      },
      'images/paye1images2/11.jpg'), //images

  Qusittionmodel(
      '  تابلو به معنای فقط گردش به راست مجاز می باشد به چه شکل نمایش داده می شود؟',
      //titels
      {
        ' دایره شکل با زمینه سفید': false, //quizes
        'دایره شکل با زمینه آبی': true,
        'مثلث شکل با زمینه قرمز': false,
        'دایره شکل با زمینه قرمز': false,
      },
      'images/paye1images2/12.jpg'), //images

  Qusittionmodel(
      ' شما چه زمانی چراغ هشدار دهنده خطر را روشن می نمایید؟', //titels
      {
        ' زمانیکه شما نمی توانید از توقف اجباری اجتناب کنید.': true, //quizes
        ' زمانیکه در محل نامناسب پارک کرده اید.': false,
        ' زمانیکه یک اتومبیل دارای نقص فنی را بکسل می کنید.': false,
        'زمانیکه در آب و هوای بد رانندگی می کنید.': false,
      },
      'images/paye1images2/13.jpg'), //images

  Qusittionmodel(
      ' درباره محل پارک خودرو کدام گزینه غلط است؟', //titels
      {
        'پارک کردن در خطوط شطرنجی داخل تقاطع ممنوع است.': false, //quizes
        ' پارک کردن مقابل درب ورودی ساختمان منازل مجاز است.': true,
        'در محلی باید پارک کرد که مانع سایر استفاده کنندگان راه نباشد.': false,
        'پارک کردن در حریم تقاطع ها و گذرگاه های عابر پیاده ممنوع است.': false,
      },
      'images/paye1images2/14.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلو شکل بالا چیست؟ ', //titels
      {
        ' خط عبور برای گریز': false, //quizes
        'بسته بودن یکی از خطوط عبور': false,
        'افزایش خطوط عبور': false,
        ' کاهش خطوط عبور': false,
      },
      'images/paye1images2/15.jpg'), //images

  Qusittionmodel(
      ' مهم ترین عامل تصادفات رانندگی چیست؟', //titels
      {
        'شرایط جاده': false, //quizes
        'شرایط آب و هوایی': false,
        ' اشتباه رانندگان': true,
        ' مسائل مکانیکی': false,
      },
      'images/paye1images2/16.jpg'), //images

  Qusittionmodel(
      ' معنی تابلوی شکل بالا چیست؟', //titels
      {
        ' رعایت حق تقدم': false, //quizes
        'به تابلو ایست نزدیک میشوید': false,
        'خطر': false,
        ' به تابلو رعایت حق تقدم نزدیک می شوید': true,
      },
      'images/paye1images2/17.jpg'), //images

  Qusittionmodel(
      ' قانون و مقررات اولیه در هنگام حرکت کردن از منتها الیه سمت …………..می باشد مگر برای ………گرفتن',
      //titels
      {
        ' راست - علامت دادن به راننده پشت سر': false, //quizes
        ' چپ - سرعت': false,
        ' راست - سبقت': true,
        'چپ - سبقت': false,
      },
      'images/paye1images2/18.jpg'), //images
  Qusittionmodel(
      ' در تقاطع بالا حق تقدم را به ترتیب مشخص کنید. ', //titels
      {
        ' آبی - نارنجی - قرمز': false, //quizes
        'قرمز - آبی - نارنجی': false,
        'نارنجی - قرمز - آبی': false,
        'قرمز - نارنجی - آبی': true,
      },
      'images/paye1images2/19.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی شکل بالا چیست؟ ', //titels
      {
        'تقاطع راه آهن با راه بند': true, //quizes
        ' تقاطع راه آهن بدون راه بند': false,
        ' تقاطع مسیر قطار': false,
        ' تقاطع جاده و راه آهن': false,
      },
      'images/paye1images2/20.jpg'), //images

  Qusittionmodel(
      'فاصله زمانی ۲ ثانیه بین شما و وسیله نقلیه جلویی چه وقتی مناسب است؟ ',
      //titels
      {
        'زمین لیز و لغزنده باشد': false, //quizes
        'هوا آفتابی و راه خشک': true,
        ' هوای برفی و در حال بارش': false,
        'هوای ابری و باران در حال بارش': false,
      },
      'images/paye1images2/21.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی شکل بالا چیست؟ ', //titels
      {
        ' تقاطع فرعی و اصلی': true, //quizes
        ' ورود به راه اصلی از راست': false,
        'ورود به راه اصلی از چپ': false,
        'تقاطع': false,
      },
      'images/paye1images2/22.jpg'), //images

  Qusittionmodel(
      ' در ۳ راه تا چه فاصله ای توقف ممنوع می باشد؟', //titels
      {
        'بیست متری': false, //quizes
        'ده متری': false,
        ' پانزده متری': true,
        'پنج متری': false,
      },
      'images/paye1images2/23.jpg'), //images

  Qusittionmodel(
      ' کدام یک از علائم زیر بر فرمان پلیس مقدم می باشد؟', //titels
      {
        'تابلو های باز دارنده': false, //quizes
        ' چراغ راهنما': false,
        'خط کشی زوجی': false,
        'هیچکدام': true,
      },
      'images/paye1images2/24.jpg'), //images

  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص استفاده از کمربند ایمنی صحیح تر است؟',
      //titels
      {
        ' بستن کمربند ایمنی برای شرنشینان زیر 12 سال در ردیف جلو الزامی است.':
            false,
        //quizes
        'بستن کمربند ایمنی برای سرنشینان ردیف جلو الزامی است.': false,
        ' بستن کمربند ایمنی برای سرنشینان ردیف عقب الزامی است.': false,
        'بستن کمربند ایمنی برای سرنشینان ردیف جلو و عقب الزامی است.': true,
      },
      'images/paye1images2/25.jpg'), //images

  Qusittionmodel(
      ' معنی تابلوی شکل بالا چیست؟', //titels
      {
        ' سمت چپ بن بست': false, //quizes
        'بن بست': false,
        'سمت راست بن بست': true,
        'خیابان بن بست': false,
      },
      'images/paye1images2/26.jpg'), //images

  Qusittionmodel(
      'حق تقدم پارک در تصویر بالا برای کدام اتومبیل می باشد؟ ', //titels
      {
        ' یک': false, //quizes
        'دو': true,
        'کسی که زودتر شروع به پارک نموده': false,
        ' اتومبیل 3 ( که 5 دقیقه دیگر می رسد )': false,
      },
      'images/paye1images2/27.jpg'), //images
  Qusittionmodel(
      'معنی تابلوی شکل بالا چیست؟ ', //titels
      {
        'عبور موتور گازی ممنوع': false, //quizes
        ' عبور موتور سیکلت ممنوع': false,
        'عبور دوچرخه ممنوع': false,
        ' عبور وسایل نقلیه موتوری ممنوع نیست': false,
      },
      'images/paye1images2/28.jpg'), //images
  Qusittionmodel(
      ' درتقاطع شکل بالا حق تقدم را به ترتیب مشخص کنید.', //titels
      {
        'مشکی - قرمز - زرد - آبی': false, //quizes
        'قرمز - مشکی - آبی یا زرد با هم': true,
        'قرمز - آبی - زرد - مشکی': false,
        ' آبی - زرد - قرمز - مشکی': false,
      },
      'images/paye1images2/29.jpg'), //images
  Qusittionmodel(
      '  تخلف انجام شده در این تصویر را مشخص کنید؟', //titels
      {
        'عدم حضور مالک وسیله نقلیه': false, //quizes
        ' پارک در محل ممنوعه': false,
        ' تجاوز به حقوق شهروندی با پارک بر روی خطوط عابر پیاده': true,
        'عدم رعایت حق تقدم': true,
      },
      'images/paye1images2/30.jpg'), //images
];
