import 'package:driving_licence_quiz/Datta/quston_model.dart';

//  ,
List<Qusittionmodel> mqusttions2 = [
  Qusittionmodel(
      ' در هنگام درمان یک مصدوم چه مواردی را به طور منظم و مداوم بایستی کنترل و ارزیابی کرد؟',
      //titels
      {
        'محل شکستگی - محل جراحت و خونریزی': false, //quizes
        ' سطح هوشیاری - نبض - تنفس - درجه حرارت': true,
        ' درجه هوا - میزان وزش باد': false,
        'محل ضرب دیدگی مصدوم - تعداد ضربان قلب - تعداد تنفس': false,
      },
      'images/mqusttions2/5.jpg'), //images

  Qusittionmodel(
      '  رانندگی هر فرد نشان دهنده چه چیزی می باشد؟', //titels
      {
        'معروف بودن': false, //quizes
        'میزان ثروت': false,
        'میزان سواد': false,
        'شخصیت و درک اجتماعی': true,
      },
      'images/mqusttions2/6.jpg'), //images

  Qusittionmodel(
      'بر اساس آیین نامه راهنمایی و رانندگی توقف عبارت است از …. ', //titels
      {
        'ایست وسیله نقلیه در زمان طولانی بدون حضور راننده': true, //quizes
        ' ایست وسیله نقلیه برای هر مدت ممنوع': false,
        'ایست وسیله نقلیه در زمان طولانی با حضور راننده': false,
        'ایست وسیله نقلیه در زمان کوتاه': false,
      },
      'images/mqusttions2/7.jpg'), //images
  Qusittionmodel(
      'برای تغییر مسیر به سمت راست و در صورتیکه وسیله نقلیه موتوری چراغ راهنما نداشته باشد باید….. ',
      //titels
      {
        'دست راست را به طرف بالا نگهداشت.': false, //quizes
        'دست راست را به طور افقی نگهداشت.': false,
        'دست چپ را به طرف بالا نگهداشت.': true,
        'دست چپ را به طور افقی نگهداشت.': false,
      },
      'images/mqusttions2/1.jpg'), //images

  Qusittionmodel(
      'کدام تابلو بیانگر آن است که عبور از هر دو سمت مجاز می باشد؟ ', //titels
      {
        'تابلو شماره 1': false, //quizes
        'تابلو شماره 2': true,
        ' تابلو شماره 3': false,
        ' تابلو شماره 4': false,
      },
      'images/mqusttions2/2.jpg'), //images
  Qusittionmodel(
      'در هنگام امداد رسانی و در صورتیکه خطر جدی مصدوم را تهدید نمی کند سعی کنید مصدومین را …… ',
      //titels
      {
        ' از محل دور نمایید.': false, //quizes
        'بدون جا به جا کردن درمان کنید.': true,
        ' به کمک سایرین به بیرون از صحنه انتقال دهید.': false,
        ' تنها گذاشته و تا رسیدن امداد به آنها دست نزنید.': false,
      },
      'images/mqusttions2/3.jpg'), //images

  Qusittionmodel(
      ' کدام مورد نمونه ای از رفتار پر خطر هنگام رانندگی است؟', //titels
      {
        'حرکت بین خطوط': false, //quizes
        'استفاده از تلفن همراه': true,
        'توجه به جلو': false,
        'رعایت فاصله طولی': false,
      },
      'images/mqusttions2/4.jpg'), //images

  Qusittionmodel(
      ' در هنگام رانندگی و مشاهده چراغ چشمک زن قرمز چه اقدامی باید انجام داد؟',
      //titels
      {
        'عبور با احتیاط': false, //quizes
        'عبور از تقاطع با سرعت زیاد و احتیاط لازم': false,
        ' ایست و عبور': true,
        'عبور از تقاطع با سرعت کم و احتیاط لازم': false,
      },
      'images/mqusttions2/8.jpg'), //images

  Qusittionmodel(
      ' هنگام ورود به میدان ها، حق تقدم عبور با وسیله ای است که …', //titels
      {
        'در درون میدان در حال حرکت است.': true, //quizes
        ' به سمت راست گردش می کند.': false,
        ' در سمت راست وسیله نقلیه ی دیگر قرار دارد.': false,
        ' به سمت مستقیم در حال حرکت است.': false,
      },
      'images/mqusttions2/9.jpg'), //images

  Qusittionmodel(
      'کدام تابلو بالا بیانگر تقاطع جاده و راه آهن در ۱۰۰ متری می باشد؟ ',
      //titels
      {
        'تابلو شماره 1': false, //quizes
        ' تابلو شماره 2': true,
        ' تابلو شماره 3': false,
        'تابلو شماره 4': false,
      },
      'images/mqusttions2/10.jpg'), //images

  Qusittionmodel(
      ' در شهرها و مناطق مسکونی، در خیایابان های شریان اصلی حداکثر سرعت چند کیلومتر در ساعت است؟',
      //titels
      {
        '50 کیلومتر در ساعت': false, //quizes
        '60 کیلومتر در ساعت': true,
        '70 کیلومتر در ساعت': false,
        '85 کیلومتر در ساعت': false,
      },
      'images/mqusttions2/11.jpg'), //images

  Qusittionmodel(
      ' علائم آگاه سازی برای سبقت در هنگام شب ……..؟', //titels
      {
        'فقط تبدیل و تعویض نور چراغ بالا و پایین': false, //quizes
        ' استفاده از بوق کوتاه': false,
        ' تبدیل و تعویض نور چراغ بالا و پایین به همراه چراغ راهنما': true,
        ' استفاده از بوق بلند به طور متناوب': false,
      },
      'images/mqusttions2/12.jpg'), //images

  Qusittionmodel(
      'مفهوم خط کشی عرضی که در ورودی تقاطع و به منظور تعیین مرز توقف وسایل نقلیه پیش از گذرگاه پیاده بر سطح راه ترسیم می شود، کدام است؟ ',
      //titels
      {
        'پیاده رو': false, //quizes
        ' خط ایست': true,
        'خط عبور': false,
        ' خطوط ممتد': false,
      },
      'images/mqusttions2/13.jpg'), //images

  Qusittionmodel(
      '  قبل از ورود به تقاطع کدامیک از اقدامات زیر را باید انجام داد؟',
      //titels
      {
        ' نگاه کردن به سرعت سنج': false, //quizes
        ' زدن راهنمای چپ': false,
        'کاهش سرعت': true,
        ' زدن راهنمای راست': false,
      },
      'images/mqusttions2/14.jpg'), //images

  Qusittionmodel(
      '  در هنگام ترمز گیری در راه های لغزنده برای جلوگیری از سر خوردن موتور سیکلت باید چه اقدامی انجام دهید؟',
      //titels
      {
        ' با سرعت از منطقه ناهموار عبور نمایید.': false, //quizes
        ' سرعت خود را کم و با احتیاط برانید.': true,
        'با سرعت ولی با ترمزهای ناگهانی عبور نمایید.': false,
        ' هرگز از راه لغزنده عبور ننمایید.': false,
      },
      'images/mqusttions2/15.jpg'), //images

  Qusittionmodel(
      ' دام یک توانایی موتور سوار را برای واکنش در برابر موانع پیش بینی نشده هنگام ورود به پیچ ها افزایش می دهد؟',
      //titels
      {
        ' افزودن سرعت و طی کردن پیچ در کمترین زمان': false, //quizes
        ' کاهش سرعت و قرار گیری در جایی که بیشترین میدان و عمق دید فراهنم شود.':
            true,
        'استفاده از دنده معکوس': false,
        'برداشتن یکی از پاها از روی جا پایی': false,
      },
      'images/mqusttions2/16.jpg'), //images

  Qusittionmodel(
      'برای رانندگی ایمن در شب کدام یک از موارد زیر را باید رعایت نمود؟ ',
      //titels
      {
        'تمیز نمودن چراغ های جلو، عقب، راهنماها و اطمینان از درستی کارکرد آنها':
            true,
        //quizes
        'هنگامی که پشت سر وسیله نقلیه دیگر حرکت می کنید کاملا به آن ها نزدیک شوید.':
            false,
        ' در صورت لغزندگی خیابان تنها از ترمز جلو استفاده نمایید.': false,
        ' به منظور داشتن دید بهتر در شب ضرورتی به استفاده از کلاه ایمنی نمی باشد.':
            false,
      },
      'images/mqusttions2/17.jpg'), //images
  Qusittionmodel(
      '  هنگام بارندگی، مه گرفتگی، گرد و غبار و به طور کلی کاهش میدان دید رانندگان باید……',
      //titels
      {
        'از نور بالا استفاده کنند.': false, //quizes
        'بستگی به نوع موتور دارد.': false,
        'بستگی به نوع طلق دارد.': false,
        'از نور پایین استفاده کنند.': true,
      },
      'images/mqusttions2/18.jpg'), //images

  Qusittionmodel(
      ' معنی تابلوی بالا چیست؟ ', //titels
      {
        ' پایان جدا کننده': true, //quizes
        'شروع جدا کننده': false,
        ' هدایت مسیر با جدا کننده': false,
        ' جریان همگرا': false,
      },
      'images/mqusttions2/19.jpg'), //images

  Qusittionmodel(
      ' کدام تابلو بالا بیانگر فقط عبور دوچرخه می باشد؟', //titels
      {
        'تابلو شماره 1': true, //quizes
        'تابلو شماره 2': false,
        'تابلو شماره 3': false,
        'تابلو شماره 4': false,
      },
      'images/mqusttions2/20.jpg'), //images

  Qusittionmodel(
      ' لباس موتور سوار بهتر است از چه رنگی باشد؟', //titels
      {
        'رنگ تیره': false, //quizes
        ' مهم نیست': false,
        'ترکیبی از رنگ های مختلف': false,
        'رنگ روشن': true,
      },
      'images/mqusttions2/21.jpg'), //images

  Qusittionmodel(
      ' منظور از طراحی خط ایست در ورودی تقاطع کدام است؟', //titels
      {
        'حرکت عابران پیاده بر روی خط مورد نظر': false, //quizes
        'مرز توقف وسایل نقلیه': true,
        ' اعلام خطر به کاربران ترافیک': false,
        ' رویت شبکه معابر در هنگام تاریکی': false,
      },
      'images/mqusttions2/22.jpg'), //images

  Qusittionmodel(
      'این تابلو بیانگر چیست؟ ', //titels
      {
        'پایان محدوده پارک آزاد': false, //quizes
        'پایان محدوده توقف ممنوع': false,
        'محدوده توقف ممنوع در ساعات معین': true,
        'منطقه محدودیت سرعت': false,
      },
      'images/mqusttions2/23.jpg'), //images

  Qusittionmodel(
      ' ممکن است رانندگان پشت سر موتورسیکلت در روز، متوجه ترمز گرفتن موتورسیکلت نشوند، چه راه کاری پیشنهاد می کنید؟',
      //titels
      {
        'روشن کردن راهنما': false, //quizes
        'فشردن متناوب پدال ترمز': true,
        ' استفاده از بوق': false,
        'فشردن پایدار پدال ترمز': false,
      },
      'images/mqusttions2/24.jpg'), //images

  Qusittionmodel(
      ' در هنگام سر خوردن چرخ عقب موتورسیکلت به هر سمت، فرمان را باید …. ؟',
      //titels
      {
        'فرمان را به همان سمت و متناسب با سرخوردن بگیرید تا موتورسیکلت در مسیر مستقیم حرکت و تعادل خود را حفظ کند.':
            true,
        //quizes
        'به همان سمت سر خوردن بگیرید.': false,
        'فرمان را باید محکم گرفت': false,
        'رها کرد و ترمز گرفت': false,
      },
      'images/mqusttions2/25.jpg'), //images

  Qusittionmodel(
      ' از پای چپ برای کنترل کدام پدال استفاده می شود؟', //titels
      {
        ' گاز': false, //quizes
        'دنده': true,
        ' ترمز': false,
        'هیچ کدام': false,
      },
      'images/mqusttions2/26.jpg'), //images
  Qusittionmodel(
      'قبل از ترک موتورسیکلت مطمئن شوید که …. ؟ ', //titels
      {
        ' موتورسیکلت در دنده یک قرار گرفته باشد': false, //quizes
        ' چرخ جلو قفل شده باشد': false,
        'سوئیچ را برداشته باشید': false,
        ' همه موارد': true,
      },
      'images/mqusttions2/27.jpg'), //images
  Qusittionmodel(
      ' تابلوی بالا به چه معناست ؟ ', //titels
      {
        ' حداقل سرعت ۶۰ کیلومتر در ساعت': true, //quizes
        'حداکثر سرعت ۶۰ کیلومتر در ساعت': false,
        'منطقه اتو سرویس در ۶۰ کیلومتری': false,
        'محل استراحت در ۶۰ کیلومتری': false,
      },
      'images/mqusttions2/28.jpg'), //images
  Qusittionmodel(
      ' وقتی پلیس مستقر در چهار راه دست راست خود را به صورت قائم نگه می دارد منظور چیست؟',
      //titels
      {
        ' رانندگان در هر چهار طرف تقاطع باید پشت خط ایست متوقف شوید': true,
        //quizes
        ' بدون توقف عبور نمایید.': false,
        ' رانندگان در حال حرکت از سرعت خود بکاهند.': false,
        'رانندگان وسایل نقلیه در حال عبور از پشت وی توقف نمایند.': false,
      },
      'images/mqusttions2/29.jpg'), //images
  Qusittionmodel(
      'هنگام عبور از کنار عابری که قصد عبور از سمت چپ به راست خیابان را دارد چه باید بکنید؟ ',
      //titels
      {
        ' باید فاصله مناسب را با وی رعایت نموده و از سمت چپ خیابان گذر کنیم.':
            false,
        //quizes
        ' باید فاصله مناسب را با وی رعایت نموده و از سمت راست خیابان گذر کنیم.':
            true,
        ' باید سریعا از سمت راست گذر کنیم.': false,
        ' باید مسیر حرکت خود را حفظ نموده و در حال مستقیم به حرکت خود ادامه دهیم.':
            false,
      },
      'images/mqusttions2/30.jpg'),

  //images
];
