import 'package:driving_licence_quiz/Datta/quston_model.dart';

//  ,
List<Qusittionmodel> mqusttions1 = [
  Qusittionmodel(
      '  در امداد رسانی به مصدومین، کدام گروه در اولویت هستند؟', //titels
      {
        'زخم های سطی': false, //quizes
        'سوختگی ها': true,
        'شکستگیهای خفیف': false,
        'افراد بیهوش': false,
      },
      'images/mqusttions1/1.jpg'), //images

  Qusittionmodel(
      'کدام تابلو بیانگر سبقت ممنوع می باشد؟ ', //titels
      {
        ' تابلو شماره یک': false, //quizes
        'تابلو شماره دو': true,
        'تابلو شماره سه': false,
        'تابلو شماره چهار': false,
      },
      'images/mqusttions1/2.jpg'), //images
  Qusittionmodel(
      'کدام خط به منظور تغییر سرعت و یا انجام حرکات گردشی و یا افزایش ظرفیت راه در کنار خط عبور ایجاد می شود؟ ',
      //titels
      {
        'خط سبقت': false, //quizes
        'خط تغییر سرعت': false,
        'خط ویژه': false,
        'خط کمکی': true,
      },
      'images/mqusttions1/3.jpg'), //images

  Qusittionmodel(
      ' جمله دیر رسیدن بهتر از هرگر نرسیدن است چه مفهومی را می رساند؟ ',
      //titels
      {
        'عدم توجه به قوانین و مقررات': false, //quizes
        ' رعایت کردن قوانین مربوط به پارک': false,
        'پرهیز از عجله و شتاب در رانندگی': true,
        ' با سرعت بالا حرکت کردن': false,
      },
      'images/mqusttions1/4.jpg'), //images

  Qusittionmodel(
      'کدام مورد زیر از عوامل تاثیر گذار در حوادث جاده ای و مرگ و میر در گروه سنی زیر ۴۰ سال در کشور می باشد؟ ',
      //titels
      {
        ' بی توجهی به فرهنگ رانندگی': true, //quizes
        'سن پایین رانندگان': false,
        ' رانندگی با رفتارهای پرخاشگرانه': false,
        'رعایت قوانین و مقررات ترافیک': false,
      },
      'images/mqusttions1/5.jpg'), //images

  Qusittionmodel(
      'نام تابلو بالا چیست؟ ', //titels
      {
        ' جاده باریک می شود.': false, //quizes
        'بر آمدگی': false,
        'دست انداز': true,
        'شانه خطرناک': false,
      },
      'images/mqusttions1/6.jpg'), //images

  Qusittionmodel(
      ' کدام مورد از مصادیق حقوق شهروندی در ترافیک می باشد؟ ', //titels
      {
        ' حرکت با سرعت زیاد': false, //quizes
        ' حرکت بین خطوط ترافیک': true,
        'حرکت غیر ایمن': false,
        ' حرکت مارپیچ در رانندگی': false,
      },
      'images/mqusttions1/7.jpg'), //images

  Qusittionmodel(
      ' کدام تابلو بیانگر تقاطع جاده و راه آهن بدون راهبند در ۳۰۰ متری می باشد؟',
      //titels
      {
        'تابلو شماره 1': false, //quizes
        ' تابلو شماره 2': false,
        ' تابلو شماره 3': true,
        ' تابلو شماره 4': false,
      },
      'images/mqusttions1/8.jpg'), //images

  Qusittionmodel(
      'راننده موتور سیکلت برای کاستن سرعت بایستی …… ', //titels
      {
        ' دست چپ را به طرف بالا نگهداشته': false, //quizes
        'دست چپ را به طور افقی نگهداشته': false,
        ' . دست راست را به طرف پایین نگهداشته': false,
        'دست چپ را به طور افقی از بالا به پایین به طور متناوب حرکت دهد.': true,
      },
      'images/mqusttions1/9.jpg'), //images

  Qusittionmodel(
      ' . کدام قسمت راه برای توقف اضطراری وسایل نقلیه به کار می رود؟', //titels
      {
        ' خط عبور': false, //quizes
        ' خط ویژه': false,
        ' خطوط ممتد ایست': false,
        'شانه راه': true,
      },
      'images/mqusttions1/10.jpg'), //images

  Qusittionmodel(
      ' تابلوی بالا بیانگر چیست؟ ', //titels
      {
        ' خط عبور برای گریز': false, //quizes
        ' بسته بودن یکی از خطوط عبور': false,
        ' سمت راست بن بست': true,
        ' بن بست': false,
      },
      'images/mqusttions1/11.jpg'), //images

  Qusittionmodel(
      ' در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند با هم وارد خیابان مجاور واحدی شوند حق تقدم عبور با وسیله نقلیه ای است که ….. ',
      //titels
      {
        ' به سمت راست گردش می کند.': true, //quizes
        'در طرف راست وسیله نقلیه دیگر قرار دارد.': false,
        'سرعت بیشتری دارد.': false,
        'در حال گردش به چپ می باشد.': false,
      },
      'images/mqusttions1/12.jpg'), //images

  Qusittionmodel(
      '  معنی تابلوی بالا چیست ؟', //titels
      {
        'پیچ به راست': true, //quizes
        'گردش به راست': false,
        ' گردش به راست ممنوع': false,
        ' همه موارد': false,
      },
      'images/mqusttions1/13.jpg'), //images

  Qusittionmodel(
      'راننده ای که مرتکب تصادف منجر به جرح و یا فوت گردیده موظف است ……؟ ',
      //titels
      {
        ' وسیله نقلیه را به کنار راه منتقل نماید.': false, //quizes
        'با رهگذران مشاوره نماید.': false,
        'علایم ایمنی هشدار دهنده نصب نماید.': true,
        ' مسیر را به کمک سایرین مسدود نماید.': false,
      },
      'images/mqusttions1/14.jpg'), //images

  Qusittionmodel(
      'کدام تابلوی بالا بیانگر پایان منطقه توقف ممنوع می باشد؟ ', //titels
      {
        'تابلو شماره 1': false, //quizes
        ' تابلو شماره 2': false,
        ' تابلو شماره 3': true,
        ' تابلو شماره 4': false,
      },
      'images/mqusttions1/15.jpg'), //images

  Qusittionmodel(
      ' در جاده فرعی در روز، حداکثر سرعت چند کیلومتر در ساعت است؟ ', //titels
      {
        ' 75 کیلومتر در ساعت': false, //quizes
        ' 85 کیلومتر در ساعت': true,
        ' 95 کیلومتر در ساعت': false,
        '70 کیلومتر در ساعت': false,
      },
      'images/mqusttions1/16.jpg'), //images

  Qusittionmodel(
      ' تابلو بالا بیانگر چیست؟', //titels
      {
        ' اصلی به فرعی': false, //quizes
        ' فرعی به اصلی از راست.': false,
        ' ورود به جاده اصلی از چپ': false,
        ' ورود به راه اصلی از راست.': true,
      },
      'images/mqusttions1/17.jpg'), //images

  Qusittionmodel(
      'در گذرگاه پیاده که چراغ راهنمایی و رانندگی وجود نداشته باشد حق تقدم عبور با ….. ',
      //titels
      {
        'پیادگان است.': true, //quizes
        'وسیله نقلیه ای که در مسیر مجاز حرکت می نماید.': false,
        ' وسیله نقلیه ای که از سرعت بالایی برخوردار است.': false,
        'وسیله نقلیه ای که به طور مستقیم حرکت می کند.': false,
      },
      'images/mqusttions1/18.jpg'), //images
  Qusittionmodel(
      ' آسیب پذیرترین اعضا در موتور سیکلت سواران کدام است؟ ', //titels
      {
        'چشم': false, //quizes
        ' زانوها': false,
        'سر، دست ها و پاها': true,
        ' انگشت های دست و پا': false,
      },
      'images/mqusttions1/19.jpg'), //images

  Qusittionmodel(
      'کدامیک از این تابلوها بیانگر این است که فقط عبور به راست مجاز می باشد؟ ',
      //titels
      {
        'تابلو شماره 1': false, //quizes
        'تابلو شماره 2': true,
        'تابلو شماره 3': false,
        ' تابلو شماره 4': false,
      },
      'images/mqusttions1/20.jpg'), //images

  Qusittionmodel(
      '  کمک های اولیه چیست؟', //titels
      {
        ' به اقدامات اولیه ای گویند که مصدوم را در محل حادثه از خطر نجات دهد.':
            false,
        //quizes
        ' به اقدامات اولیه گویند که بلافاصله پس از بروز حادثه و قبل از رسیدن به مرکز درمانی صورت می گیرد.':
            true,
        ' به اقدامات اولیه گویند که در درمانگاه یا مراکز اورژانس انجام می شود.':
            false,
        'به اقداماتی گویند که توسط پرستاران در مرکز اورژانس انجام پذیرد.':
            false,
      },
      'images/mqusttions1/21.jpg'), //images

  Qusittionmodel(
      '. کدامیک از موارد زیر در خصوص حمل ترک نشین صحیح است؟ ', //titels
      {
        'راننده باید تجربه و مهارت لازم را داشته باشد - هر دو پای ترک نشین باید روی جاپایی باشد حتی هنگام توقف - موتور ظرفیت حمل ترک نشین را داشته باشد.':
            true,
        //quizes
        ' تجربه و مهارت لازم برای راننده - هر دو پای ترک نشین باید روی جاپایی باشد به جز هنگام توقف- موتور ظرفیت ترک نشین را داشته باشد.':
            false,
        ' تجربه و مهارت لازم برای راننده - استفاده از راهنما به هنگام سوار کردن ترک نشین':
            false,
        ' موتور ظرفیت حمل ترک نشین را داشته باشد - کمک فنرها تنظیم و زنجیر لق باشد.':
            false,
      },
      'images/mqusttions1/22.jpg'), //images

  Qusittionmodel(
      ' تابلوی بالا چه مفهومی دارد؟ ', //titels
      {
        'پایان سبقت ممنوع': true, //quizes
        'ابتدای سبقت ممنوع': false,
        'پایان سبقت کامیون ممنوع': false,
        ' پایان محدوده سرعت': false,
      },
      'images/mqusttions1/23.jpg'), //images

  Qusittionmodel(
      ' وضعیت زانوها هنگام انجام گردش به چه شکل باید باشد؟', //titels
      {
        'باز کردن پاها و فاصله دادن زانوها از باک': false, //quizes
        'نگه داشتن کنار باک': true,
        'برداشتن یکی از پاها از روی جاپایی و باز کردن زانو': false,
        ' بالا آوردن زانوها به سمت شکم': false,
      },
      'images/mqusttions1/24.jpg'), //images

  Qusittionmodel(
      '  حداقل تجهیزات موتور سوار چیست؟', //titels
      {
        ' کلاه ایمنی، کاپشن، شلوار مناسب، دستکش و چکمه': true, //quizes
        ' کلاه ایمنی و چکمه': false,
        'کاپشن، شلوار مناسب و عینک': false,
        ' عینک، کلاه ایمنی، دستکش و چکمه': false,
      },
      'images/mqusttions1/25.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟ ', //titels
      {
        'گذرگاه عابر پیاده': false, //quizes
        'عبور اطفال': true,
        ' عبور پیاده ممنوع': false,
        'عبور پیاده': false,
      },
      'images/mqusttions1/26.jpg'), //images

  Qusittionmodel(
      ' ابعاد مناسب موتور سیکلت چگونه تعیین می شود؟ ', //titels
      {
        'ارتفاع نشیمن گاه کمتر از یک متر باشد.': false, //quizes
        'دست کم نوک انگشتان پا باید با زمین تماس داشته باشد.': false,
        'وقتی زین موتور سیکلت بین پاها قرار دارد، هر دو پا باید به طور کامل روی زمین باشد.':
            true,
        ' تنها اگر یکی از پاها بتواند زمین را لمس کند کافی است.': false,
      },
      'images/mqusttions1/27.jpg'), //images
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص عبور موتور سیکلت از سطوح خطرناک صحیح است؟',
      //titels
      {
        ' هنگام عبور از ریل راه آهنی که مورب است باید سرعت را کاهش داده و عمود بر ریل از روی آن عبور کرد.':
            true,
        //quizes
        '. حرکت بر روی سطوحی که اصطکاک مناسبی ایجاد می کنند خطرناک است.': false,
        'مواد ریخته شده بر روی راه آسفالته نظیر روغن ها عامل ایجاد اصطکاکند.':
            false,
        'زمین های خیس عامل ایجاد اصطکاک زیاد بین چرخ ها و سطح راه می باشد.':
            false,
      },
      'images/mqusttions1/28.jpg'), //images
  Qusittionmodel(
      ' . شما راننده موتور سیکلت برای تغییر مسیر موظفید از چه فاصله ای از راهنما استفاده نمایید؟',
      //titels
      {
        '150 متری': false, //quizes
        '100 متری': true,
        '250 متری': false,
        '120 متری': false,
      },
      'images/mqusttions1/29.jpg'), //images

  Qusittionmodel(
      '  نام خطوط مشخص شده در این تصویر چیست؟', //titels
      {
        'خطوط توقف منقطع': false, //quizes
        'خطوط هاشور': false,
        'خطوط اضطرار': true,
        'خطوط زیگزاگ': false,
      },
      'images/mqusttions1/30.jpg'), //images
];
