import 'package:driving_licence_quiz/Datta/quston_model.dart';

//42
List<Qusittionmodel> P3qusttion5 = [
  Qusittionmodel(
      'وظیفه کدام قطعه ممانعت از ورود گرد و غبار و دیگر ذرات معلق به داخل موتور می باشد؟ ',
      //titels
      {
        'فیلتر روغن': false, //quizes
        'فیلتر سوخت': false,
        'فیلتر هوا': true,
        ' فن': false,
      },
      'images/p1images3/5.jpg'), //images

  Qusittionmodel(
      'در خصوص احتیاط های لازم هنگام وقوع تصادف انجام کدامیک از موارد زیر اشتباه است؟ ',
      //titels
      {
        ' روش نگه داشتن خودرو حتی در صورتی که خودرو قابلیت حرکت ندارد.': true,
        //quizes
        'هشدار توسط افراد به دیگر رانندگان تا سرعت خودرو را کاهش دهند.': false,
        'استفاده از تابلو اعلان خطر': false,
        'تذکر جهت روشن نکرن سیگار در صورت آسیب باک سوخت خودروها': false,
      },
      'images/p1images3/6.jpg'), //images

  Qusittionmodel(
      ' سطح روغن موتور را با چه وسیله ای می توان کنترل نمود؟', //titels
      {
        ' فیلتر روغن': false, //quizes
        'در مخزن روغن': false,
        'سیم روغن (گیج روغن)': true,
        'پمپ روغن': false,
      },
      'images/p1images3/7.jpg'), //images
  Qusittionmodel(
      ' حق تقدم عبور را در تقاطع شکل زیر مشخص کنید. ( براساس رنگ خودرو)',
      //titels
      {
        ' نارنجی وسبز همزمان – قرمز': false, //quizes
        'سبز- قرمز – نارنجی': false,
        'نارنجی – سبز – قزمز': false,
        'قرمز- سبز - نارنجی': true,
      },
      'images/p1images2/20.jpg'), //images

  Qusittionmodel(
      'کدام جمله درباره کیسه هوا صحیح نمی باشد؟ ', //titels
      {
        'فعال شدن کیسه هوا در حالتی که کمربند ایمنی بسته نشده باشد، نتایج مخرب تری خواهد داشت.':
            true,
        //quizes
        'در خودروهای مجهز به کیسه هوا دیگر نیازی به کمربند ایمنی نمی باشد.':
            false,
        'یکی از تکنولوژی های پیشرفته در زمینه ایمنی خودرو، سیستم کیسه هوا یا ایربگ می باشد.':
            false,
        ' کیسه هوا، هنگام تشخیص ضربه ناشی از تصادف در کسری از ثانیه باز می شود.':
            false,
      },
      'images/p1images2/21.jpg'), //images

  Qusittionmodel(
      ' چراغ هایی که حضور وسیله نقلیه و عرض آن را از سمت جلو نشان می دهد کدام است؟',
      //titels
      {
        'چراغ جانبی جلو': true, //quizes
        'چراغ جانبی عقب': false,
        'چراغ های کوچک عقب': false,
        'چراغ توقف': false,
      },
      'images/p1images2/22.jpg'), //images

  Qusittionmodel(
      '  از کدام علامت آگاه سازی برای سبقت در شب استفاده می شود؟', //titels
      {
        'استفاده از بوق کوتاه': false, //quizes
        'فقط تبدیل و تعویض نور چراغ بالا و پایین': false,
        ' تبدیل و تعویض نور چراغ بالا و پایین به همراه چراغ راهنما': true,
        'استفاده از بوق بلند بطور متناوب': false,
      },
      'images/p1images2/23.jpg'), //images

  Qusittionmodel(
      'کدام مورد زیر از رفتارهای رانندگان پرخاشگر و پرخطر می باشد؟ ', //titels
      {
        'تغییر مسیر با زدن چراغ راهنما': false, //quizes
        'استفاده از نور بالا در محل های مجاز': false,
        ' عبور از خط مقابل برای رهایی از ترافیک': false,
        'رعایت سرعت مطمئنه و رانندگی بین خطوط': false,
      },
      'images/p1images2/24.jpg'), //images

  Qusittionmodel(
      ' از زمانی که راننده تشخیص می دهد نیاز به توقف و ایستادن دارد تا لحظه بکارگیری ترمزها چه نامیده می شود؟',
      //titels
      {
        'زمان حیاتی': false, //quizes
        ' زمان هوشیاری': false,
        ' زمان توقف': false,
        'زمان واکنش': true,
      },
      'images/p1images2/25.jpg'), //images

  Qusittionmodel(
      ' در چه مواردی می توانید به رانندگان و عابرین با چراغ علامت دهید؟',
      //titels
      {
        'جهت اعلام اینکه به آنها راه داده اید.': false, //quizes
        'جهت اعلام اینکه دنده عقب می روید.': false,
        'جهت اعلام اینکه حق تقدم با شماست.': false,
        'جهت اعلام حضور به آنها.': true,
      },
      'images/p1images2/26.jpg'), //images

  Qusittionmodel(
      '  دست کم هر چند وقت یکبار باید سطح آب رادیاتور را کنترل نمود؟', //titels
      {
        'سالی یکبار': false, //quizes
        'هفته ای یکبار': true,
        ' ماهی یکبار': false,
        'نیازی به کنترل ندارد': false,
      },
      'images/p1images2/27.jpg'), //images

  Qusittionmodel(
      ' مفهوم خطوط طولی در شکل بالا چیست؟', //titels
      {
        ' به هیچ وجه نباید از روی آن عبور نمود.': true, //quizes
        ' عبور از روی آن مجاز می باشد.': false,
        ' با احتیاط می توان از روی آن دور زد.': false,
        'در صورت لزوم می توان از روی آن سبقت گرفت.': false,
      },
      'images/p1images2/28.jpg'), //images

  Qusittionmodel(
      'ساییدگی نا متوازن یا بیش از حد لاستیک ناشی از کدام موارد زیر است؟ ',
      //titels
      {
        'میزان نبودن باد چرخها': false, //quizes
        'سرعت بیش از حد': false,
        ' تنظیم نبودن فرمان عدم تنظیم چرخها و ترمزها': true,
        'تاب داشتن گاردان': false,
      },
      'images/p1images2/29.jpg'), //images

  Qusittionmodel(
      'در معابر محلی و میادین شهرها، حداکثر سرعت چند کیلومتر در ساعت است؟ ',
      //titels
      {
        '65 کیلومتر در ساعت': false, //quizes
        '55 کیلومتر در ساعت': false,
        '45 کیلومتر در ساعت': false,
        ' 30 کیلومتر در ساعت': true,
      },
      'images/p1images3/8.jpg'), //images

  Qusittionmodel(
      'کدامیک از موارد زیر در خصوص نقاط کور در وسایل نقلیه صحیح نمی باشد؟ ',
      //titels
      {
        'موتور سیکلتها دارای نقاط کور نمی باشند.': true, //quizes
        '. با تنظیم دقیق آئینه ها می توان میزان نقاط کور را کاهش داد.': false,
        'حتی با تنظیم دقیق آئینه ها نمی توان نقاط کور را در خودرها حذف نمود.':
            false,
        'میزان وسعت نقاط کور در خودروهای سنگین بیشتر از خودروهای سبک است.':
            false,
      },
      'images/p1images3/9.jpg'), //images

  Qusittionmodel(
      ' تحت چه شرایطی می توان در تقاطع ها سبقت گرفت؟', //titels
      {
        'اگر تقاطع خلوت باشد.': false, //quizes
        ' اگر چراغ تقاطع چشمک زن باشد.': false,
        'سبقت در تقاطع ها ممنوع است.': true,
        ' اگر مسیر یک طرفه باشد.': false,
      },
      'images/p1images3/10.jpg'), //images

  Qusittionmodel(
      ' با مشاهده چراغ قرمز راهنمایی و در صورت نبودن خط ایست برای توقف، در چند متری چراغ باید توقف کنیم؟',
      //titels
      {
        'سه متری': false, //quizes
        'دو متری': false,
        ' پنج متری': true,
        'چهار متری': false,
      },
      'images/p1images2/11.jpg'), //images

  Qusittionmodel(
      ' در کنترل و تنظیم عبور و مرور کدام مورد بر سایرین مقدم است؟', //titels
      {
        'خط کشی و ترسیم ها': false, //quizes
        'چراغ راهنمایی': false,
        'فرمان پلیس': true,
        'تابلوهای راهنمایی': false,
      },
      'images/p1images2/12.jpg'), //images

  Qusittionmodel(
      ' منظور از تخطی از محدودیت های سرعتی در راه ها کدام است؟', //titels
      {
        'رعایت سرعت مطمئنه': false, //quizes
        'عدم رعایت سرعت مجاز تعیین شده': false,
        ' رعایت قوانین و مقررات تعیین شده': false,
        'تجاوز به حریم قانونی دیگران': true,
      },
      'images/p1images2/13.jpg'), //images

  Qusittionmodel(
      '  کدامیک از موارد زیر، مفهوم چراغ قرمز می باشد؟', //titels
      {
        'این چراغ نشان دهنده آن است که می توانید با احتیاط از تقاطع عبور نمایید.':
            false,
        //quizes
        'به معنی هشدار جهت تغییر رنگ چراغ است و باید با دیدن آن توقف سپس حرکت نمایید.':
            false,
        'با دیدن این چراغ شما می توانید به آرامی و در صورتیکه معبر خالی است از تقعاطع عبور نمایید.':
            false,
        ' این چراغ به معنی توقف می باشد و با دیدن آن باید پشت خط ایست توقف نمود.':
            true,
      },
      'images/p1images2/14.jpg'), //images

  Qusittionmodel(
      ' برای کاستن سرعت هنگامی که وسیله نقلیه فاقد چراغ راهنما باشد باید……….',
      //titels
      {
        'دست راست را به طرف پایین نگهداشت': false, //quizes
        ' دست چپ را به طرف بالا نگهداشت': false,
        'دست چپ را به طور افقی نگهداشت': false,
        'دست چپ را به طور افقی از بالا به پایین حرکت داد': true,
      },
      'images/p1images2/15.jpg'), //images

  Qusittionmodel(
      ' کدام چراغ راهنمایی معمولا در محل بر خورد راه اصلی با راه فرعی نصب می گردد؟ ',
      //titels
      {
        'چراغ چشمک زن زرد': true, //quizes
        'چراغ چشمک زن قرمز': false,
        'چراغ چشمک زن قرمز برای ایست': false,
        'چراغ چشمک زن قرمز برای عبور': false,
      },
      'images/p1images2/16.jpg'), //images

  Qusittionmodel(
      'برای انجام کمک های اولیه اگر آرامش ندارید چه باید بکنید؟ ', //titels
      {
        'به مصدوم بگویید در حال حاضر آرامش ندارید و نمی توانید کاری برای او انجام دهید.':
            false,
        //quizes
        'باید هر چه سریعتر صحنه را ترک نمایید و از محل حادثه دور شوید.': false,
        'باید سریعا رائه کمکهای اولیه را به اتمام رسانید.': false,
        'کشیدن چند نفس عمیق و آرام به شما کمک می کند تا آرامش خود را بدست آورده و به شرایط محیط تسلط یابید.':
            true,
      },
      'images/p1images2/17.jpg'), //images

  Qusittionmodel(
      'در شهرها و مناطق مسکونی، در خیابان های شریان اصلی حداکثر سرعت چند کیلومتر در ساعت است؟ ',
      //titels
      {
        '90 کیلومتر در ساعت': false, //quizes
        '100 کیلومتر در ساعت': false,
        '70 کیلومتر در ساعت': false,
        ' 60 کیلومتر در ساعت': true,
      },
      'images/p1images2/18.jpg'), //images

  Qusittionmodel(
      'کدام مورد زیر از علائم خستگی و خواب آلودگی راننده نمی باشد؟ ', //titels
      {
        'حرکات نوسانی سر و گردن و احساس سنگنی در پلک ها': false, //quizes
        'عدم تمرکز در رانندگی و رویا پردازی در ذهن': false,
        'عدم توانایی کنترل خودرو بین خطوط و کاهش سرعت واکنش نسبت به شرایط':
            false,
        'کنترل خودرو و حرکت بین خطوط': true,
      },
      'images/p1images2/19.jpg'), //images

  Qusittionmodel(
      'بر روی جاده خیس ترمزی می کنید وسیله شما شروع به لغزش می کند اولین کاری که انجام می دهید چیست؟ ',
      //titels
      {
        'ترمز را کاملا آزاد می کنید': true, //quizes
        'به سرعت ترمز دستی را بکشید': false,
        'پای خود را با شدت بیشتری بر ترمز فشار دهید': false,
        'پای خود را بر روی کلاج بگذارید': false,
      },
      'images/p1images2/30.jpg'), //images
];
