import 'package:driving_licence_quiz/Datta/quston_model.dart';

//  ,quiz 2 &quiz 1 paye 3
List<Qusittionmodel> P3qusttions3 = [
  Qusittionmodel(
      ' درباره محل پارک خودرو کدام گزینه غلط است؟', //titels
      {
        'پارک کردن در خطوط شطرنجی داخل تقاطع ممنوع است.': false, //quizes
        ' پارک کردن مقابل درب ورودی ساختمان منازل مجاز است.': true,
        'در محلی باید پارک کرد که مانع سایر استفاده کنندگان راه نباشد.': false,
        'پارک کردن در حریم تقاطع ها و گذرگاه های عابر پیاده ممنوع است.': false,
      },
      'images/paye1images2/14.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلو شکل بالا چیست؟ ', //titels
      {
        ' خط عبور برای گریز': false, //quizes
        'بسته بودن یکی از خطوط عبور': false,
        'افزایش خطوط عبور': false,
        ' کاهش خطوط عبور': false,
      },
      'images/paye1images2/15.jpg'), //images

  Qusittionmodel(
      ' مهم ترین عامل تصادفات رانندگی چیست؟', //titels
      {
        'شرایط جاده': false, //quizes
        'شرایط آب و هوایی': false,
        ' اشتباه رانندگان': true,
        ' مسائل مکانیکی': false,
      },
      'images/paye1images2/16.jpg'), //images

  Qusittionmodel(
      ' معنی تابلوی شکل بالا چیست؟', //titels
      {
        ' رعایت حق تقدم': false, //quizes
        'به تابلو ایست نزدیک میشوید': false,
        'خطر': false,
        ' به تابلو رعایت حق تقدم نزدیک می شوید': true,
      },
      'images/paye1images2/17.jpg'), //images

  Qusittionmodel(
      ' قانون و مقررات اولیه در هنگام حرکت کردن از منتها الیه سمت …………..می باشد مگر برای ………گرفتن',
      //titels
      {
        ' راست - علامت دادن به راننده پشت سر': false, //quizes
        ' چپ - سرعت': false,
        ' راست - سبقت': true,
        'چپ - سبقت': false,
      },
      'images/paye1images2/18.jpg'), //images
  Qusittionmodel(
      ' در تقاطع بالا حق تقدم را به ترتیب مشخص کنید. ', //titels
      {
        ' آبی - نارنجی - قرمز': false, //quizes
        'قرمز - آبی - نارنجی': false,
        'نارنجی - قرمز - آبی': false,
        'قرمز - نارنجی - آبی': true,
      },
      'images/paye1images2/19.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی شکل بالا چیست؟ ', //titels
      {
        'تقاطع راه آهن با راه بند': true, //quizes
        ' تقاطع راه آهن بدون راه بند': false,
        ' تقاطع مسیر قطار': false,
        ' تقاطع جاده و راه آهن': false,
      },
      'images/paye1images2/20.jpg'), //images

  Qusittionmodel(
      'فاصله زمانی ۲ ثانیه بین شما و وسیله نقلیه جلویی چه وقتی مناسب است؟ ',
      //titels
      {
        'زمین لیز و لغزنده باشد': false, //quizes
        'هوا آفتابی و راه خشک': true,
        ' هوای برفی و در حال بارش': false,
        'هوای ابری و باران در حال بارش': false,
      },
      'images/paye1images2/21.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی شکل بالا چیست؟ ', //titels
      {
        ' تقاطع فرعی و اصلی': true, //quizes
        ' ورود به راه اصلی از راست': false,
        'ورود به راه اصلی از چپ': false,
        'تقاطع': false,
      },
      'images/paye1images2/22.jpg'), //images

  Qusittionmodel(
      ' در ۳ راه تا چه فاصله ای توقف ممنوع می باشد؟', //titels
      {
        'بیست متری': false, //quizes
        'ده متری': false,
        ' پانزده متری': true,
        'پنج متری': false,
      },
      'images/paye1images2/23.jpg'), //images

  Qusittionmodel(
      ' کدام یک از علائم زیر بر فرمان پلیس مقدم می باشد؟', //titels
      {
        'تابلو های باز دارنده': false, //quizes
        ' چراغ راهنما': false,
        'خط کشی زوجی': false,
        'هیچکدام': true,
      },
      'images/paye1images2/24.jpg'), //images

  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص استفاده از کمربند ایمنی صحیح تر است؟',
      //titels
      {
        ' بستن کمربند ایمنی برای شرنشینان زیر 12 سال در ردیف جلو الزامی است.':
            false,
        //quizes
        'بستن کمربند ایمنی برای سرنشینان ردیف جلو الزامی است.': false,
        ' بستن کمربند ایمنی برای سرنشینان ردیف عقب الزامی است.': false,
        'بستن کمربند ایمنی برای سرنشینان ردیف جلو و عقب الزامی است.': true,
      },
      'images/paye1images2/25.jpg'), //images

  Qusittionmodel(
      'در بزرگراه اتومبیل شما دچار نقص فنی میشود برای هشدار به وسائط نقلیه دیگر تابلوی احتیاط را در چه فاصله ای از اتومبیل خود قرار می دهید؟',
      {
        ' 120 متری': false,
        ' 150 متری': false,
        ' 50 متری': true,
        ' 110 متری': false,
      },
      'images/1.jpg'),
  Qusittionmodel(
      'در چند متر مانده به پیچ ها سبقت ممنوع است؟',
      {
        '100 متری': false,
        '70 متری': true,
        '150 متری': false,
        '50 متری': false,
      },
      'images/2.jpg'),
  Qusittionmodel(
      'به عنوان یک کمک دهنده به یک مصدوم باید چه مواردی را در اولیت قرار داد؟ ',
      {
        'ارزیابی موقعیت و در خواست کمک': false,
        'ارائه کمک های اولیه': false,
        ' امن کردن محل حادثه': false,
        ' همه موارد': true,
      },
      'images/3.jpg'),
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص نقاط کور در وسایل نقلیه صحیح نمی باشد؟',
      {
        'با تنظیم دقیق آئینه ها می توان میزن نقاط کور را کاهش داد': false,
        'موتورسیکلت ها دارای نقاط کور نمی باشند.': true,
        'حتی با تنظیم دقیق آئینه ها نمی توان نقاط کور را در خودروها حذف نمود':
            false,
        'میزان وسعت نقاط کور در خودروهای سنگین بیشتر از خودروهای سبک است':
            false,
      },
      'images/4.jpg'),
  Qusittionmodel(
      'کدام تابلو درباره عبور عابر پیاده هشدار می دهد؟', //titels
      {
        'تابلوی شماره دو': true, //quizes
        'تابلوی شماره یک': false,
        'تابلوی شماره چهار': false,
        ' تابلوی شماره سه': false,
      },
      'images/5.jpg'), //images
  Qusittionmodel(
      'چرا موتور سواران نسبت به رانندگان اتومبیل آسیب پذیر ترند؟', //titels
      {
        ' سرعت آنها از اتومبیل ها سریعتر است': false, //quizes
        'تغییرات سطح راه بر روی آنها تاثیرات بیشتری دارد.': true,
        'نسبت به اتومبیل شتاب بیشتری میگیرند': false,
        ' با سرعت بیشتری پیچ ها را طی میکنند': false,
      },
      'images/6.jpg'), //images
  Qusittionmodel(
      'مقدار ولتاژ باتری در خودروهای معمول سواری چند ولت است؟', //titels
      {
        '48 ولت': false, //quizes
        '12 ولت': false,
        '24 ولت': true,
        '5 ولت': false,
      },
      'images/7.jpg'), //images
  Qusittionmodel(
      'در چند متر مانده به تونل ها و پل ها سبقت ممنوع است؟', //titels
      {
        '100 متری': true, //quizes
        '50 متری': false,
        '150 متری': false,
        '70 متری': false,
      },
      'images/8.jpg'), //images
  Qusittionmodel(
      'شکل بالا چه موردی را هشدار می دهد؟', //titels
      {
        'در هنگام عبور از کنار گذر حق تقدم عبور با وسیله نقلیه است': false,
        //quizes
        'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید باید مراقب حرکت عابرین پیاده که در حال گذر می باشند بوده و به آنها اجازه عبور دهید':
            true,
        'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید می توانید با احتیاط عبور کنید':
            false,
        'هیچ کدام': false,
      },
      'images/9.jpg'), //images
  Qusittionmodel(
      'کدامیک از موارد زیرنشان دهنده بوجود آمدن حالت خستگی و خواب آلودگی در حین رانندگی است؟',
      //titels
      {
        ' احساس سنگینی در پلکها - کنترل آگاهانه خودرو - عدم توانایی کنترل خودرو':
            false,
        //quizes
        ' پلک زدن - عدم کنترل خودرو': false,
        ' افزایش سرعت واکنش نسبت به شرایط - احساس سنگینی در پلکها': false,
        'احساس سنگینی پلکها - عدم کنترل آگاهانه سرعت خودرو - عدم تمرکز روی رانندگی':
            true,
      },
      'images/10.jpg'), //images
  Qusittionmodel(
      'استفاده از بوق در کدامیک از موارد زیر مجاز است؟', //titels
      {
        'اطلاع و آگاه سازی سایر کاربران راه و جلوگیری از بروز سانحه و خطر':
            true,
        //quizes
        'اطلاع و آگاه سازی برای ادای احترام به سایر کاربران راه': false,
        'برای کاهش شدت تصادفات': false,
        'برای کاهش شدت تصادفات و آگاهی سایر کاربران  و مراسم خاص مثل عروسی':
            false,
      },
      'images/11.jpg'), //images
  Qusittionmodel(
      'میزان سرعت مجاز و محدودیت سرعت در جاده ها و خیابانها به چه صورت مشخص می شود؟',
      //titels
      {
        'با توجه به مواردی که GPS خودرو نشان می دهد.': false, //quizes
        ' با توجه به دستور پلیس در جاده ها مشخص می شود': false,
        'سرعت مجاز بسته به نوع خودرو و مدل آن قابل تغییر است': false,
        'با توجه به تابلوهای نصب شده و آیین نامه راهنمایی و رانندگی.': true,
      },
      'images/12.jpg'), //images
  Qusittionmodel(
      'در هنگام ایمن کردن صحنه تصادف انجام کدامیک از موارد زیر صحیح نمی باشد؟',
      //titels
      {
        ' استفاده از تابلو اعلان خطر در فاصله مناسب از تصادف': false, //quizes
        'پارک کردن خودروی خود در فاصله مناسب از صحنه حادثه': false,
        'به خطر انداختن خود برای نجات دیگران': true,
        'استفاده از وسایل روشنایی برای اعلان خطر در شب': false,
      },
      'images/13.jpg'), //images
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص رانندگی در شب صحیح است؟ ', //titels
      {
        ' با افزایش سرعت در شبها می توان کاهش دید را جبران کرد': false, //quizes
        'میزان تصادفات در شب کاهش می یابد': false,
        'در شب زمان کمتری طول می کشد تا راننده موانع موجود را ببیند': false,
        'محدوده دید راننده در شب کاهش می یابد': true,
      },
      'images/14.jpg'), //images
  Qusittionmodel(
      'دور زدن از روی خط پر و یا یک خط ممتد .....', //titels
      {
        'از 150 متری ورودی تونل ها': false, //quizes
        'از 100 متری پس از پیچ ها': false,
        'ز 100 متری مانده به پیچ ها': false,
        'ممنوع است': true,
      },
      'images/15.jpg'), //images
  Qusittionmodel(
      'در چه فاصله ای از اطراف چراغهای راهنمایی و رانندگی توقف ممنوع می باشد؟',
      //titels
      {
        '15 متری': true, //quizes
        '45 متری': false,
        '25 متری': false,
        '5 متری': false,
      },
      'images/16.jpg'), //images
  Qusittionmodel(
      'چرا شکسته و کثیف بودن شیشه های خودرو می تواند خطرناک باشد؟', //titels
      {
        'چون باعث کاهش انعکاس نور می شود': false, //quizes
        'خطری ندارد': false,
        'چون باعث کاهش دید می شود': true,
        ' چون باعث افزایش انعکاس نور می شود': false,
      },
      'images/17.jpg'), //images
  Qusittionmodel(
      'آیا رانندگان وسایل نقلیه امدادی در هنگام ماموریت مجاز به عبور از محل ممنوع می باشند؟',
      //titels
      {
        'به علت خطرات موجود نمی توانند عبور ممنوع بروند': true, //quizes
        'بستگی به شرایط دارد': false,
        'در هر شرایطی مجاز هستند': false,
        'در صورتیکه موجب تصادف نشوند': false,
      },
      'images/18.jpg'), //images
];
