import 'package:driving_licence_quiz/Datta/quston_model.dart';

// 42 ,30
List<Qusittionmodel> P1qusttions4 = [
  Qusittionmodel(
      ' هرگاه دارنده گواهینامه رانندگی یکی از شرایط پزشکی مربوطه برای رانندگی را از دست بدهد بایستی….',
      //titels
      {
        'با همان وضعیت به رانندگی ادامه دهد.': false, //quizes
        'ظرف مدت یک ماه به راهنمایی و رانندگی مراجعه نماید.': true,
        'به آن توجهی ننماید.': false,
        'به درمانگاه مراجعه نماید.': false,
      },
      'images/p1images4/1.jpg'), //images

  Qusittionmodel(
      'علائم اخباری برای گرفتن سبقت در روز کدام مورد است؟ ', //titels
      {
        'بوق کوتاه و چراغ راهنما': true, //quizes
        'تعویض نور چراغ بالا و پایین': false,
        'اشاره با دست': false,
        'بوق مکرر و ممتد': false,
      },
      'images/p1images4/2.jpg'), //images

  Qusittionmodel(
      ' میزان سرعت مجاز در آزاد راه ها و بزرگراه ها چگونه تعیین می شود؟',
      //titels
      {
        'براساس تابلوهای نصب شده': true, //quizes
        ' براساس میزان سرعت خودرو': false,
        ' براساس مهارت راننده': false,
        'براساس فصول سال': false,
      },
      'images/p1images4/3.jpg'), //images

  Qusittionmodel(
      '  مفهوم تابلوی بالا چیست؟', //titels
      {
        'جاده دست انداز دارد': false, //quizes
        'به دست انداز نزدیک می شوید': false,
        ' عبور با احتیاط از دست انداز': false,
        'دست انداز': true,
      },
      'images/p1images4/4.jpg'), //images

  Qusittionmodel(
      ' حداکثر سرعت در میدان ها چند کیلومتر در ساعت است؟', //titels
      {
        ' 70 کیلومتر در ساعت': false, //quizes
        '30 کیلومتر در ساعت': true,
        ' 50 کیلومتر در ساعت': false,
        ' 60 کیلومتر در ساعت': false,
      },
      'images/p1images4/5.jpg'), //images

  Qusittionmodel(
      'در کدام موارد زیر توقف مجاز است؟ ', //titels
      {
        ' روی پل': false, //quizes
        ' درون تونل ها': false,
        ' معابر در ارتفاع': false,
        ' 30 متری میادین': true,
      },
      'images/p1images4/6.jpg'), //images

  Qusittionmodel(
      'کدامیک از موارد زیر در خصوص تبدیل نور بالا به پایین اشتباه می باشد؟ ',
      //titels
      {
        'زمانی که فاصله خودروی که از روبرو به شما نزدیک می شود 150 متر یا کمتر باشد نور بالا را به نور پایین تبدیل کنید.':
            false,
        //quizes
        'زمانی که فاصله شما با خودرویی که در جلوی شما در حرکت است 150 متر یا کمتر است.':
            false,
        'زمانی که خودرویی در پشت سر شما حرکت می کند نور بالا ره به نور پایین تبدیل کنید.':
            true,
        'زمانی که خورویی از روبرو به شما نزدیک می شود نور بالا را به نور پایین تبدیل کنید.':
            false,
      },
      'images/p1images4/7.jpg'), //images

  Qusittionmodel(
      'یکی از علت های نقض قوانین و مقررات و بی احترامی به سایر رانندگان و انجام اقدامات حادثه ساز توسط راننده کدام است؟ ',
      //titels
      {
        'وقت شناس نبودن و عدم برنامه ریزی مناسب برای رسیدن به مقصد': true,
        //quizes
        'داشتن خودروی ایمن': false,
        'از مهارت و تجربه کافی در رانندگی بر خوردار است.': false,
        ' راننده در زمان خلوتی معابر می تواند قوانین و مقررات را نقض و اقدامات حادثه ساز انجام دهد.':
            false,
      },
      'images/p1images4/8.jpg'), //images

  Qusittionmodel(
      'کدام مورد از مصادیق حقوق شهروندی در حین رانندگی می باشد؟ ', //titels
      {
        'حرکت با سرعت غیرمجاز': false, //quizes
        'حرکت غیر ایمن': false,
        'حرکت بین خطوط ترافیک': true,
        'حرکت مارپیچ در رانندگی': false,
      },
      'images/p1images4/9.jpg'), //images
  Qusittionmodel(
      'یکی از راههای کاهش مصرف سوخت کدام است ؟ ', //titels
      {
        'تنظیم باد تایرها': true, //quizes
        '-باز کردن ترموستات خودرو در تابستان': false,
        'حرکت با سرعت زیاد': false,
        'عدم تنظیم موتور': false,
      },
      'images/p1images4/10.jpg'), //images

  Qusittionmodel(
      'برای راه اندازی خودرو راننده در چه مرحله ای بایستی کمربند ایمنی را ببندد؟ ',
      //titels
      {
        'در حین حرکت': false, //quizes
        'پس از روشن کردن موتور خودرو': true,
        'قبل از روشن کردن موتور خودرو': false,
        'نیازی به بستن کمربند ایمنی نمی باشد': false,
      },
      'images/p1images4/11.jpg'), //images

  Qusittionmodel(
      '  حق تقدم عبور را در تقاطع زیر مشخص کنید.', //titels
      {
        'سواری - کامیون - اتوبوس': false, //quizes
        'اتوبوس - سواری - کامیون': false,
        'کامیون - اتوبوس - سواری': true,
        'کامیون - سواری - اتوبوس': false,
      },
      'images/p1images4/12.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟ ', //titels
      {
        'عبور با ارتفاع 2.4 متر ممنوع': false, //quizes
        'عبور با عرض 2.4 متر ممنوع': false,
        ' عبور با وزن 2.4 تن ممنوع': false,
        'عبور با بار بیش از 2.4 تن بر هر محور ممنوع': true,
      },
      'images/p1images4/13.jpg'), //images

  Qusittionmodel(
      ' در هنگام پارک در سربالایی و در راه بدون جدول،فرمان وسیله نقلیه باید به کدام سمت چرخانده شود؟',
      //titels
      {
        'سمت چپ': false, //quizes
        'سمت راست': true,
        'فرقی ندارد': false,
        'مخالف عقربه ساعت': false,
      },
      'images/p1images4/14.jpg'), //images

  Qusittionmodel(
      '  به مجموعه رفتارهای منفی در رانندگی چه می گویند؟', //titels
      {
        ' رانندگی ایمن': false, //quizes
        'رانندگی خطر ساز و یا رانندگی تهاجمی': true,
        'رانندگی مطمئنه': false,
        'فرهنگ رانندگی': false,
      },
      'images/p1images4/15.jpg'), //images

  Qusittionmodel(
      ' در ارزیابی مصدومین کدامیک از مصدومین را باید در اولیت انجام کمک های اولیه قرار داد؟',
      //titels
      {
        ' مصدومینی که آسیبهای آنها کمتر است.': false, //quizes
        'مصدومینی که آسیبهای آنها بسیار شدید است نظیر سوختگی ها یا زخمهای وسیع':
            true,
        'کودکان در اولیت انجام کمکهای اولیه هستند.': false,
        'مصدومینی که از سن بالاتری دارند نسبت به سایر مصدومین بر خورداند.':
            false,
      },
      'images/p1images4/16.jpg'), //images

  Qusittionmodel(
      'اگر خودرویی با نور بالا از روبرو به شما نزدیک شود چه باید بکنید؟ ',
      //titels
      {
        'سرعت را کاهش داده و سمت راست جاده نگاه کرده و با کنار چشم حرکت خودرو مقابل را تحت نظر داشت.':
            true,
        //quizes
        'باید سرعت را افزایش داده و سریع از کنار آن عبور کرد.': false,
        ' باید با تبدیل نور پایین به نور بالا و بوق ممتد او را متوجه نموده که از نور پایین استفاده کند.':
            false,
        ' باید سرعت را کاهش داده و به سمت جاده نگاه کرد.': false,
      },
      'images/p1images4/17.jpg'), //images
  Qusittionmodel(
      ' کدام یک از موارد زیر جزو رفتار ناهنجار اجتماعی و ناپسند نمی باشد؟',
      //titels
      {
        'نصب بوق های گوش خراش': false, //quizes
        ' استفاده از لامپ های غیر مجاز': false,
        'نصب سیستم های صوتی پر قدرت': false,
        'رانندگی با سرعت مجاز': true,
      },
      'images/p1images4/18.jpg'), //images

  Qusittionmodel(
      ' به منظور جلوگیری از آسیب رسی به بخش های موتور تسمه تایم پس از طی چه مسافتی بایستی تعویض شود؟',
      //titels
      {
        'بین 10 تا 15 هزار کیلومتر': false, //quizes
        'بین 60 تا 90 هزار کیلومتر': true,
        'با هر بار تعویض روغن': false,
        'هر 5 هزار کیلومتر': false,
      },
      'images/p1images4/19.jpg'), //images

  Qusittionmodel(
      'از زمانی که راننده تشخیص می دهد نیاز به توقف دارد تا لحظه به کار گرفتن ترمزها چه نام دارد؟ ',
      //titels
      {
        'زمان واکنش': true, //quizes
        'مسافت توقف': false,
        'مسافت ترمز': false,
        ' زمان ترمز': false,
      },
      'images/p1images4/20.jpg'), //images

  Qusittionmodel(
      ' توقف و یا ایستادن در کدام یک از محل های زیر مجاز است؟', //titels
      {
        ' گذرگاه پیاده': false, //quizes
        ' پیاده رو': false,
        'کنار وسایل نقلیه ای که خود متوقف می باشد': false,
        'محدوده پارک آزاد': true,
      },
      'images/p1images4/21.jpg'), //images

  Qusittionmodel(
      'در کدامیک از موارد زیر بوق زدن مجاز است؟ ', //titels
      {
        'صدا زدن افراد': false, //quizes
        ' اعلام حضور و باز کردن در منزل': false,
        'سبقت مجاز در روز': true,
        ' خداحافظی': false,
      },
      'images/p1images4/22.jpg'), //images

  Qusittionmodel(
      ' حق تقدم عبور را مشخص کنید (آمبولانس در حال ماموریت است)', //titels
      {
        ' 3 - 1 - 2 - 4': false, //quizes
        '1 - 3 - 2 - 4': false,
        '4 - 2 - 1 - 3': false,
        ' 3 - 2 - 4 - 1': true,
      },
      'images/p1images4/23.jpg'), //images

  Qusittionmodel(
      ' کدام مورد نمونه ای از رفتار پر خطر هنگام رانندگی است؟ ', //titels
      {
        ' حرکت بین خطوط': false, //quizes
        'توجه به جلو': false,
        ' استفاده از تلفن همراه': true,
        'عدم رعایت فاصله طولی': false,
      },
      'images/p1images4/24.jpg'), //images

  Qusittionmodel(
      'انجام کدامیک از موارد زیر در هنگام تنفس مصنوعی صحیح تر است؟ ', //titels
      {
        'خارج کردن اجسام خارجی از دهان مصدوم، دادن تنفس مصنوعی، بررسی تنفس حداقل به مدت 20 ثانیه':
            false,
        //quizes
        'خارج کردن اجسام خارجی از دهان مصدوم، بررسی تنفس حداقل به مدت 20 ثانیه، دادن تنفس به مدا 5 ثانیه':
            false,
        'خارج کردن اجسام خارجی از دهان مصدوم، باز کردن راه هوایی با بالا بردن چانه مصدوم، بررسی داشتن تنفس پس از باز بودن راه هوایی':
            true,
        ' باز کردن دهان مصدوم و دادن تنفس مصنوعی، بررسی تنفس به مدت 20 ثانیه ، دادن تنفس مصنوعی با مدت 5 ثانیه':
            false,
      },
      'images/p1images4/25.jpg'), //images

  Qusittionmodel(
      ' مفهوم تابلوی بالا چیست؟', //titels
      {
        'خطر در تقاطع خطوط راه آهن': false, //quizes
        'تقاطع با راه آهن دو خطه': true,
        ' تقاطع خطوط راه آهن': false,
        ' هچیکدام': false,
      },
      'images/p1images4/26.jpg'), //images

  Qusittionmodel(
      ' عنوان کدام یک از تابلوهای بالا راهنمای مسیر می باشد؟', //titels
      {
        ' 1': false, //quizes
        ' 2': false,
        '3': false,
        '2 و 4': true,
      },
      'images/p1images4/27.jpg'), //images
  Qusittionmodel(
      ' وظیفه رانندگان در برخورد با وسیله نقلیه امدادی که دستگاههای خبری و صوتی را به کار انداخته چیست؟',
      //titels
      {
        'در کنار وسیله نقلیه حرکت کنند.': false, //quizes
        ' باید به منتهی الیه سمت راست هدایت و عندالزوم تا گذشتن وسیله نقلیه امدادی توقف کنند.':
            true,
        ' به مسیر خود ادامه دهند.': false,
        'به سمت پچ متمایل شوند.': false,
      },
      'images/p1images4/28.jpg'), //images

  Qusittionmodel(
      ' شما در اتومبیل خود دو کودک دارید چه کسی مسئولیت دارد که کودکان کمربند ایمنی را بسته باشند؟',
      //titels
      {
        'کودکان': false, //quizes
        'والدین بچه ها': false,
        'راننده': true,
        'مسافری که صندلی جلو نشسته': false,
      },
      'images/p1images4/29.jpg'), //images

  Qusittionmodel(
      '  شکل بالا چه موردی را هشدار می دهد؟', //titels
      {
        ' زمانی که شرایط جاده استاندارد نیست و چاله و دست انداز وجود دارد باید احتیاط نمود.':
            true,
        //quizes
        'در شرایطی مانند مه یا ریزش باران که شعاع دید کم است باید با سرعت کمتر از محدوده سرعت قانونی حرکت نمود.':
            false,
        'در شرایطی که در جاده عابر پیاده یا دوچرخه سوار وجود دارد باید سرعت مناسب را انتخاب نمود.':
            false,
        'در نزدیکی مراکز خرید از سرعت خود بکاهید.': false,
      },
      'images/p1images4/30.jpg'), //images
];
