import 'package:driving_licence_quiz/Datta/quston_model.dart';

// 43
List<Qusittionmodel> P1qusttions3 = [
  Qusittionmodel(
      ' علائم خستگی در رانندگی چیست؟', //titels
      {
        'راندن خودرو با سرعت مطمئنه و رعایت قوانین و مقررات.': false, //quizes
        'کم شدن توجه به رانندگی و کاهش سرعت تصمیم گیری.': true,
        'نشاط و پر انرژی بودن در رانندگی': false,
        'رانندگی ایمن و رعایت سرعت مجاز': false,
      },
      'images/p1images3/1.jpg'), //images

  Qusittionmodel(
      'کدام گزینه در مورد رانندگی ایمن درست است؟ ', //titels
      {
        'در بعضی از موارد لازم است از حق خود چشم پوشی کنید.': true, //quizes
        'تحت هیچ شرایطی نباید از حق خود چشم پوشی کنید.': false,
        'در شرایط اضطرای می توان تابلو ورود ممنوع را نادیده گرفت.': false,
        'همیشه با سرعت بالا حرکت کنید تا زودتر به مقصد برسید.': false,
      },
      'images/p1images3/2.jpg'), //images

  Qusittionmodel(
      'در راههای پر ترافیکی که خودروها پشت سر هم به صورت فشرده در حرکت هستند، چگونه می توانید از بروز تصادف جلوگیری کنید؟ ',
      //titels
      {
        'در شانه خاکی توقف کنید.': false, //quizes
        'چراغهای خطر را روشن کنید.': false,
        'فاصله خود را با اتومبیل جلویی افزایش دهید.': true,
        'پای خود را برروی ترمز قرار دهید.': false,
      },
      'images/p1images3/3.jpg'), //images

  Qusittionmodel(
      '  در کدامیک از موارد زیر احتمال وقوع تصادفات کمتر است؟', //titels
      {
        'هوای خشک، شرایط جاده استاندارد': true, //quizes
        ' وجود مه، ریزش باران، کولاک': false,
        ' وجود مه، ریزش باران، شرایط جاده استاندارد': false,
        'وجود چاله و دست انداز در جاده، ریزش باران': false,
      },
      'images/p1images3/4.jpg'), //images

  Qusittionmodel(
      'وظیفه کدام قطعه ممانعت از ورود گرد و غبار و دیگر ذرات معلق به داخل موتور می باشد؟ ',
      //titels
      {
        'فیلتر روغن': false, //quizes
        'فیلتر سوخت': false,
        'فیلتر هوا': true,
        ' فن': false,
      },
      'images/p1images3/5.jpg'), //images

  Qusittionmodel(
      'در خصوص احتیاط های لازم هنگام وقوع تصادف انجام کدامیک از موارد زیر اشتباه است؟ ',
      //titels
      {
        ' روش نگه داشتن خودرو حتی در صورتی که خودرو قابلیت حرکت ندارد.': true,
        //quizes
        'هشدار توسط افراد به دیگر رانندگان تا سرعت خودرو را کاهش دهند.': false,
        'استفاده از تابلو اعلان خطر': false,
        'تذکر جهت روشن نکرن سیگار در صورت آسیب باک سوخت خودروها': false,
      },
      'images/p1images3/6.jpg'), //images

  Qusittionmodel(
      ' سطح روغن موتور را با چه وسیله ای می توان کنترل نمود؟', //titels
      {
        ' فیلتر روغن': false, //quizes
        'در مخزن روغن': false,
        'سیم روغن (گیج روغن)': true,
        'پمپ روغن': false,
      },
      'images/p1images3/7.jpg'), //images

  Qusittionmodel(
      'در معابر محلی و میادین شهرها، حداکثر سرعت چند کیلومتر در ساعت است؟ ',
      //titels
      {
        '65 کیلومتر در ساعت': false, //quizes
        '55 کیلومتر در ساعت': false,
        '45 کیلومتر در ساعت': false,
        ' 30 کیلومتر در ساعت': true,
      },
      'images/p1images3/8.jpg'), //images

  Qusittionmodel(
      'کدامیک از موارد زیر در خصوص نقاط کور در وسایل نقلیه صحیح نمی باشد؟ ',
      //titels
      {
        'موتور سیکلتها دارای نقاط کور نمی باشند.': true, //quizes
        '. با تنظیم دقیق آئینه ها می توان میزان نقاط کور را کاهش داد.': false,
        'حتی با تنظیم دقیق آئینه ها نمی توان نقاط کور را در خودرها حذف نمود.':
            false,
        'میزان وسعت نقاط کور در خودروهای سنگین بیشتر از خودروهای سبک است.':
            false,
      },
      'images/p1images3/9.jpg'), //images

  Qusittionmodel(
      ' تحت چه شرایطی می توان در تقاطع ها سبقت گرفت؟', //titels
      {
        'اگر تقاطع خلوت باشد.': false, //quizes
        ' اگر چراغ تقاطع چشمک زن باشد.': false,
        'سبقت در تقاطع ها ممنوع است.': true,
        ' اگر مسیر یک طرفه باشد.': false,
      },
      'images/p1images3/10.jpg'), //images

  Qusittionmodel(
      'ایستادن یا توقف وسایل نقلیه در کدام یک محلهای زیر ممنوع است؟ ', //titels
      {
        'از 50 متری شیرهای آتش نشانی': false, //quizes
        ' در فاصله 50 متری میدان یا تقاطع یا سه راهها یا تقاطع راه آهن': false,
        ' از 100 متری ابتدا تا انتهای پیچ ها': false,
        'از 15 متری ورودی بیمارستان ها': true,
      },
      'images/p1images3/11.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟ ', //titels
      {
        'عبور ممنوع': false,
        ' عبور با طول بیش از 10 متر ممنوع': true, //quizes
        'عبور با ارتفاع بیش از 10 متر ممنوع': false,
        'عبور با عرض بیش از 10 متر ممنوع': false,
      },
      'images/p1images3/12.jpg'), //images

  Qusittionmodel(
      'در محبث مفهوم رنگها و علائم عبور و مرور، مفهوم رنگ قهوه ای کدام است؟ ',
      //titels
      {
        ' راهنمای خدمات': false, //quizes
        'علائم دستوری': false,
        'راهنمای مسیر در سایر راه ها': false,
        'راهنمای مناطق تفریحی و گردشگری و فرهنگی': true,
      },
      'images/p1images3/13.jpg'), //images

  Qusittionmodel(
      ' حمل مسافر در قسمت بار ……… ', //titels
      {
        'مجاز است.': false, //quizes
        'در صورت رعایت ایمنی مجاز است.': false,
        'در مسافت های کوتاه مجاز است.': false,
        'ممنوع است.': true,
      },
      'images/p1images3/14.jpg'), //images

  Qusittionmodel(
      'در صورت مشاهده این تابلو منتظر چه چیزی باید بود؟ ', //titels
      {
        'گردش به چپ ممنوع': false, //quizes
        'پیچ های پی در پی (اولین پیچ به چپ)': false,
        'پیچ به راست': false,
        'پیچ به چپ': true
      },
      'images/p1images3/15.jpg'), //images

  Qusittionmodel(
      'کدام یک از اجزای موتور نمی باشد؟ ', //titels
      {
        'دیفرانسیل': true, //quizes
        'سرسیلندر': false,
        'میل لنگ': false,
        'فلایول': false,
      },
      'images/p1images3/16.jpg'), //images

  Qusittionmodel(
      '  ترمز دستی معمولا …………عمل می کند.', //titels
      {
        'فقط برچرخهای جلو': false, //quizes
        'فقط بر چرخهای عقب': true,
        'فقط بر چرخهای سمت راست': false,
        'فقط بر چرخهای سمت چپ': false,
      },
      'images/p1images3/17.jpg'), //images

  Qusittionmodel(
      'رانندگانی که قصد گردش به راست یا به چپ را دارند مکلفند از چه فاصله ای به وسیله چراغ راهنما علامت بدهند؟ ',
      //titels
      {
        ' 250 متری': false, //quizes
        '150 متری': false,
        '300 متری': false,
        '100 متری': true,
      },
      'images/p1images3/18.jpg'), //images

  Qusittionmodel(
      ' کدامیک از موارد زیر در حین رانندگی در شب اشتباه است؟', //titels
      {
        'روشن نمودن چراغ های کوچک و بزرگ بطور همزمان': false, //quizes
        ' کاهش سرعت در صورت نزدیک شدن خودرویی از روبرو که از نور بالا استفاده می کند.':
            false,
        'استفاده از بوق کوتاه هنگام سبقت': true,
        ' استفاده از چراغ مه شکن در هنگام ریزش باران': false,
      },
      'images/p1images3/19.jpg'), //images

  Qusittionmodel(
      '  راننده ای که دست چپ را به طور افقی نگه داشته به چه معناست؟', //titels
      {
        'گردش یا تعییر مسیر به راست': false, //quizes
        'گردش یا تغییر مسیر به چپ': true,
        'افزایش سرعت': false,
        ' توقف': false,
      },
      'images/p1images3/20.jpg'), //images

  Qusittionmodel(
      'کدام یک از تابولهای بالا مفهوم آن است که پیچ های در جلو وجود دارد؟ ',
      //titels
      {
        'شکل شماره 2': false, //quizes
        'شکل شماره 3': false,
        'شکل شماره 1': true,
        ' شکل شماره 4': false,
      },
      'images/p1images3/21.jpg'), //images

  Qusittionmodel(
      ' در خصوص آتش سوزی خودرو انجام کدامیک از موارد زیر صحیح تر می باشد؟ ',
      //titels
      {
        'در هنگام آتش سوزی خودرو باید ابتدا از شعله ور شدن موتور خودرو جلوگیری بعمل آورد.':
            true,
        //quizes
        'در صورت وجود کپسول آتش نشانی با استفاده از آن آتش را خاموش نموده و در صورت عدم وجود کپسول آتش نشانی با پتو با یک جسم غیرقابل اشتعال شعله را خفه کنید.':
            false,
        'در هنگام آتش سوزی خودرو باید ابتدا قستمهای داخلی خودرو را خاموش نمود.':
            false,
        'احتمال انفجاز خودرو در صورتی که شعله به داخل خودرو انتقال یابد زیاد است.':
            false,
      },
      'images/p1images3/22.jpg'), //images

  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟ ', //titels
      {
        'انتهای منطقه سرعت محدود': false, //quizes
        'ابتدای محدودیت ها': false,
        'پایان سبقت ممنوع': false,
        'پایان تمام محدودیت ها': true,
      },
      'images/p1images3/23.jpg'), //images

  Qusittionmodel(
      'هنرجوی گرامی در تقاطع بالا حق تقدم را مشخص کنید.', //titels
      {
        'اتوبوس - کامیون - سواری - دوچرخه': false, //quizes
        'دوچرخه - اتوبوس - کامیون - سواری': false,
        'کامیون - سواری - اتوبوس - دوچرخه': true,
        'سواری - کامیون - اتوبوس - دوچرخه': false,
      },
      'images/p1images3/24.jpg'), //images

  Qusittionmodel(
      '  کدامیک جزو وظایف سیستم تعلیق نمی باشد؟', //titels
      {
        'کنترل قدرت و شتاب خودرو': true, //quizes
        'تامین راحتی راننده': false,
        'حفظ تعادل و پایداری خودرو هنگام عبور از پستی یا بلندی ها': false,
        'ممانعت از واژگونی خودرو هنگام عبور از پیچها': false,
      },
      'images/p1images3/25.jpg'), //images

  Qusittionmodel(
      'از چند متری تقاطع راه آهن سبقت گرفتن ممنوع است؟ ', //titels
      {
        '50 متری': true, //quizes
        '100 متری': false,
        ' 150 متری': false,
        'محدویت ندارد': false,
      },
      'images/p1images3/26.jpg'), //images

  Qusittionmodel(
      ' برای گردش به چپ در راه های برون شهری که دارای دو خط عبور رفت و برگشت بدون مانع فیزیکی جدا کننده می باشد رانندگان باید ابتدا وسیله نقلیه را ……',
      //titels
      {
        'سمت چپ راه قرار گرفته و سپس با رعایت حق تقدم گردش نمایند.': false,
        //quizes
        'در سمت چپ راه متوقف نمایند.': false,
        'در شانه راه و یا منتهی الیه سمت راست راه متوقف نمایند.': true,
        'در سمت چپ راه قرار گرفته و با زدن راهنما اقدام به گردش نمایند.': false,
      },
      'images/p1images3/27.jpg'), //images

  Qusittionmodel(
      'هدف از ………تسلط کامل پاها و دستها بر تجیزات کنترلی همچون پدالها، اهرمها و غربیلک فرمان می باشد. ',
      //titels
      {
        '. معانیه فنی': false, //quizes
        'تنظیم آینه ها': false,
        ' سلامت فنی': false,
        ' تنظیم صندلی': true,
      },
      'images/p1images3/28.jpg'), //images

  Qusittionmodel(
      ' در گذرگاه پیاده که چراغ راهنمایی و رانندگی وجود نداشته باشد حق تقدم عبور با ……… ',
      //titels
      {
        'وسیله نقلیه ای که در مسیر مجاز حرکت می نماید.': false, //quizes
        'وسیله نقلیه ای که از سرعت بالایی برخوردار است': false,
        'وسیله نقلیه ای که به طور مستقیم حرکت می کند.': false,
        'پیادگان است.': true,
      },
      'images/p1images3/29.jpg'), //images

  Qusittionmodel(
      'هنرجوی گرامی تصویر بالا بیانگر چیست؟ ', //titels
      {
        'تا 200 متر پارک کردن مجاز است': false, //quizes
        'طول ممنوعیت با محدودیت پارکینگ': false,
        'فاصله از محل نصب تابلو تا شروع قسمت خطر': true,
        'رعایت فاصله کمتر از 200 متر ممنوع': false,
      },
      'images/p1images3/30.jpg'), //images
];
