import 'package:driving_licence_quiz/Datta/quston_model.dart';

//42
List<Qusittionmodel> P1qusttions2 = [
  Qusittionmodel(
      'مفهوم تابلوی بالا چیست؟', //titels
      {
        ' عبور حیوانات وحشی': false, //quizes
        ' عبور حیوانات اهلی': true,
        'منطقه حیات وحش': false,
        ' محل عبور حیوانات': false,
      },
      'images/p1images2/1.jpg'), //images
  Qusittionmodel(
      'کدامیک از موارد زیر صحیح است؟ ', //titels
      {
        'حمل مسافر در قسمت بار یا صندوق عقب ممنوع است.': true, //quizes
        'سبقت گرفتن برای اتوبوسها و کامیونها ممنوع است.': false,
        'از 150 متر مانده به ورودی تونها و پل ها سبقت ممنوع است.': false,
        ' از 100 متر مانده به پیچ ها تا 100 متر پس از آن سبقت گرفتن ممنوع است.':
            false,
      },
      'images/p1images2/2.jpg'), //images
  Qusittionmodel(
      ' کدام گزینه در مورد گردش به چپ در راههای یکطرفه درست است؟', //titels
      {
        'باید منتظر بمانند تا خیابان خلوت شود.': false, //quizes
        'رانندگان موظفند وسیله نقلیه را به منتهی الیه طرف چپ خیابان هدایت و سپس به چپ گردش کنند.':
            true,
        'گردش به چپ در خیابان یکطرفه ممنوع است.': false,
        'رانندگان موظفند وسیله نقلیه را به منتهی الیه طرف راست خیابان هدایت و سپس به چپ گردش کنند.':
            false,
      },
      'images/p1images2/3.jpg'), //images
  Qusittionmodel(
      ' خط عبوری که به منظور تغییر سرعت، انجام حرکات گردشی و یا افزایش ظرفیت راه در کنار خط عبور ایجاد می شود؟',
      //titels
      {
        'خط ویژه': false, //quizes
        'خط تغییر سرعت': false,
        'خط ایست': false,
        'خط کمکی': true,
      },
      'images/p1images2/4.jpg'), //images
  Qusittionmodel(
      ' هنرجوی گرامی تابلوی بالا بیانگر چیست؟', //titels
      {
        ' عبور موتور گازی ممنوع': false, //quizes
        'سبقت موتور سیکلت ممنوع': false,
        'عبور وسائط نقلیه موتوری ممنوع': false,
        ' عبور موتور سیکلت ممنوع': true,
      },
      'images/p1images2/5.jpg'), //images
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص عبور از روی خط آهن صحیح می باشد؟', //titels
      {
        'در طول عبور از خط آهن دنده خودرو باید از دنده سنگین به دنده سبک تغییر داد.':
            false,
        //quizes
        'در طول عبور از خط آهن دنده خودرو باید از دنده سبک به دنده سنگین تغییر داد.':
            false,
        'در طول عبور از خط آهن دنده خودرو را نباید تعویض نمود.': true,
        'قبل از رسیدن به خط آهن باید سرعت را افزایش داده و با سرعت از خط آهن عبور نمود.':
            false,
      },
      'images/p1images2/6.jpg'), //images
  Qusittionmodel(
      'هنگام سبقت گرفتن اعم از اینکه روز باشد یا شب، برای جلب توجه وسایل نقلیه پشت سر، انجام کدام مورد زیر ضروری است؟ ',
      //titels
      {
        'بوق زدن': false, //quizes
        'تبدیل نور چراغ خودرو': false,
        'اشاره با دست': false,
        'زدن چراغ راهنما': true,
      },
      'images/p1images2/7.jpg'), //images
  Qusittionmodel(
      '  در چه شرایطی می توان مانع سبقت گرفتن خودروی در حال سبقت شد؟', //titels
      {
        'زمانی که هوا رو به تاریکی است.': false, //quizes
        'زمانی که سرعت خودرو سبقت گیرنده خیلی زیاد باشد.': false,
        'زمانی که شرایط بارانی یا برفی است.': false,
        'در هیچ شرایطی': true,
      },
      'images/p1images2/8.jpg'), //images
  Qusittionmodel(
      ' مهمترین نکته ای که در خرید خودرو باید در نظر داشت چیست؟', //titels
      {
        'نوع خودرو': false, //quizes
        'زیبایی ظاهری': false,
        'تجهیزات ایمنی': false,
        'سطح ایمنی': true,
      },
      'images/p1images2/9.jpg'), //images

  Qusittionmodel(
      ' بلند کردن دستهای پلیس به دو طرف و بطور افقی به چه معناست', //titels
      {
        'کلیه وسایل نقلیه مقابل پلیس قرار گرفته اند باید بایستند.': false,
        //quizes
        'کلیه استفاده کنندگان در راه که جهت حرکت آنها در امتداد جهت نشان داده شده با دست پا دست های پلیس میباشد باید بایستند.':
            true,
        'کلیه وسایل نقلیه که پشت سر پلیس قرار گرفته اند باید بایستند.': false,
        'کلیه وسایل نقلیه که در امتداد جهت دست پلیس قرار گرفته اند باید سریع عبور نمایند.':
            false,
      },
      'images/p1images2/10.jpg'), //images

  Qusittionmodel(
      ' با مشاهده چراغ قرمز راهنمایی و در صورت نبودن خط ایست برای توقف، در چند متری چراغ باید توقف کنیم؟',
      //titels
      {
        'سه متری': false, //quizes
        'دو متری': false,
        ' پنج متری': true,
        'چهار متری': false,
      },
      'images/p1images2/11.jpg'), //images

  Qusittionmodel(
      ' در کنترل و تنظیم عبور و مرور کدام مورد بر سایرین مقدم است؟', //titels
      {
        'خط کشی و ترسیم ها': false, //quizes
        'چراغ راهنمایی': false,
        'فرمان پلیس': true,
        'تابلوهای راهنمایی': false,
      },
      'images/p1images2/12.jpg'), //images

  Qusittionmodel(
      ' منظور از تخطی از محدودیت های سرعتی در راه ها کدام است؟', //titels
      {
        'رعایت سرعت مطمئنه': false, //quizes
        'عدم رعایت سرعت مجاز تعیین شده': false,
        ' رعایت قوانین و مقررات تعیین شده': false,
        'تجاوز به حریم قانونی دیگران': true,
      },
      'images/p1images2/13.jpg'), //images

  Qusittionmodel(
      '  کدامیک از موارد زیر، مفهوم چراغ قرمز می باشد؟', //titels
      {
        'این چراغ نشان دهنده آن است که می توانید با احتیاط از تقاطع عبور نمایید.':
            false,
        //quizes
        'به معنی هشدار جهت تغییر رنگ چراغ است و باید با دیدن آن توقف سپس حرکت نمایید.':
            false,
        'با دیدن این چراغ شما می توانید به آرامی و در صورتیکه معبر خالی است از تقعاطع عبور نمایید.':
            false,
        ' این چراغ به معنی توقف می باشد و با دیدن آن باید پشت خط ایست توقف نمود.':
            true,
      },
      'images/p1images2/14.jpg'), //images

  Qusittionmodel(
      ' برای کاستن سرعت هنگامی که وسیله نقلیه فاقد چراغ راهنما باشد باید……….',
      //titels
      {
        'دست راست را به طرف پایین نگهداشت': false, //quizes
        ' دست چپ را به طرف بالا نگهداشت': false,
        'دست چپ را به طور افقی نگهداشت': false,
        'دست چپ را به طور افقی از بالا به پایین حرکت داد': true,
      },
      'images/p1images2/15.jpg'), //images

  Qusittionmodel(
      ' کدام چراغ راهنمایی معمولا در محل بر خورد راه اصلی با راه فرعی نصب می گردد؟ ',
      //titels
      {
        'چراغ چشمک زن زرد': true, //quizes
        'چراغ چشمک زن قرمز': false,
        'چراغ چشمک زن قرمز برای ایست': false,
        'چراغ چشمک زن قرمز برای عبور': false,
      },
      'images/p1images2/16.jpg'), //images

  Qusittionmodel(
      'برای انجام کمک های اولیه اگر آرامش ندارید چه باید بکنید؟ ', //titels
      {
        'به مصدوم بگویید در حال حاضر آرامش ندارید و نمی توانید کاری برای او انجام دهید.':
            false,
        //quizes
        'باید هر چه سریعتر صحنه را ترک نمایید و از محل حادثه دور شوید.': false,
        'باید سریعا رائه کمکهای اولیه را به اتمام رسانید.': false,
        'کشیدن چند نفس عمیق و آرام به شما کمک می کند تا آرامش خود را بدست آورده و به شرایط محیط تسلط یابید.':
            true,
      },
      'images/p1images2/17.jpg'), //images

  Qusittionmodel(
      'در شهرها و مناطق مسکونی، در خیابان های شریان اصلی حداکثر سرعت چند کیلومتر در ساعت است؟ ',
      //titels
      {
        '90 کیلومتر در ساعت': false, //quizes
        '100 کیلومتر در ساعت': false,
        '70 کیلومتر در ساعت': false,
        ' 60 کیلومتر در ساعت': true,
      },
      'images/p1images2/18.jpg'), //images

  Qusittionmodel(
      'کدام مورد زیر از علائم خستگی و خواب آلودگی راننده نمی باشد؟ ', //titels
      {
        'حرکات نوسانی سر و گردن و احساس سنگنی در پلک ها': false, //quizes
        'عدم تمرکز در رانندگی و رویا پردازی در ذهن': false,
        'عدم توانایی کنترل خودرو بین خطوط و کاهش سرعت واکنش نسبت به شرایط':
            false,
        'کنترل خودرو و حرکت بین خطوط': true,
      },
      'images/p1images2/19.jpg'), //images

  Qusittionmodel(
      ' حق تقدم عبور را در تقاطع شکل زیر مشخص کنید. ( براساس رنگ خودرو)',
      //titels
      {
        ' نارنجی وسبز همزمان – قرمز': false, //quizes
        'سبز- قرمز – نارنجی': false,
        'نارنجی – سبز – قزمز': false,
        'قرمز- سبز - نارنجی': true,
      },
      'images/p1images2/20.jpg'), //images

  Qusittionmodel(
      'کدام جمله درباره کیسه هوا صحیح نمی باشد؟ ', //titels
      {
        'فعال شدن کیسه هوا در حالتی که کمربند ایمنی بسته نشده باشد، نتایج مخرب تری خواهد داشت.':
            true,
        //quizes
        'در خودروهای مجهز به کیسه هوا دیگر نیازی به کمربند ایمنی نمی باشد.':
            false,
        'یکی از تکنولوژی های پیشرفته در زمینه ایمنی خودرو، سیستم کیسه هوا یا ایربگ می باشد.':
            false,
        ' کیسه هوا، هنگام تشخیص ضربه ناشی از تصادف در کسری از ثانیه باز می شود.':
            false,
      },
      'images/p1images2/21.jpg'), //images

  Qusittionmodel(
      ' چراغ هایی که حضور وسیله نقلیه و عرض آن را از سمت جلو نشان می دهد کدام است؟',
      //titels
      {
        'چراغ جانبی جلو': true, //quizes
        'چراغ جانبی عقب': false,
        'چراغ های کوچک عقب': false,
        'چراغ توقف': false,
      },
      'images/p1images2/22.jpg'), //images

  Qusittionmodel(
      '  از کدام علامت آگاه سازی برای سبقت در شب استفاده می شود؟', //titels
      {
        'استفاده از بوق کوتاه': false, //quizes
        'فقط تبدیل و تعویض نور چراغ بالا و پایین': false,
        ' تبدیل و تعویض نور چراغ بالا و پایین به همراه چراغ راهنما': true,
        'استفاده از بوق بلند بطور متناوب': false,
      },
      'images/p1images2/23.jpg'), //images

  Qusittionmodel(
      'کدام مورد زیر از رفتارهای رانندگان پرخاشگر و پرخطر می باشد؟ ', //titels
      {
        'تغییر مسیر با زدن چراغ راهنما': false, //quizes
        'استفاده از نور بالا در محل های مجاز': false,
        ' عبور از خط مقابل برای رهایی از ترافیک': false,
        'رعایت سرعت مطمئنه و رانندگی بین خطوط': false,
      },
      'images/p1images2/24.jpg'), //images

  Qusittionmodel(
      ' از زمانی که راننده تشخیص می دهد نیاز به توقف و ایستادن دارد تا لحظه بکارگیری ترمزها چه نامیده می شود؟',
      //titels
      {
        'زمان حیاتی': false, //quizes
        ' زمان هوشیاری': false,
        ' زمان توقف': false,
        'زمان واکنش': true,
      },
      'images/p1images2/25.jpg'), //images

  Qusittionmodel(
      ' در چه مواردی می توانید به رانندگان و عابرین با چراغ علامت دهید؟',
      //titels
      {
        'جهت اعلام اینکه به آنها راه داده اید.': false, //quizes
        'جهت اعلام اینکه دنده عقب می روید.': false,
        'جهت اعلام اینکه حق تقدم با شماست.': false,
        'جهت اعلام حضور به آنها.': true,
      },
      'images/p1images2/26.jpg'), //images

  Qusittionmodel(
      '  دست کم هر چند وقت یکبار باید سطح آب رادیاتور را کنترل نمود؟', //titels
      {
        'سالی یکبار': false, //quizes
        'هفته ای یکبار': true,
        ' ماهی یکبار': false,
        'نیازی به کنترل ندارد': false,
      },
      'images/p1images2/27.jpg'), //images

  Qusittionmodel(
      ' مفهوم خطوط طولی در شکل بالا چیست؟', //titels
      {
        ' به هیچ وجه نباید از روی آن عبور نمود.': true, //quizes
        ' عبور از روی آن مجاز می باشد.': false,
        ' با احتیاط می توان از روی آن دور زد.': false,
        'در صورت لزوم می توان از روی آن سبقت گرفت.': false,
      },
      'images/p1images2/28.jpg'), //images

  Qusittionmodel(
      'ساییدگی نا متوازن یا بیش از حد لاستیک ناشی از کدام موارد زیر است؟ ',
      //titels
      {
        'میزان نبودن باد چرخها': false, //quizes
        'سرعت بیش از حد': false,
        ' تنظیم نبودن فرمان عدم تنظیم چرخها و ترمزها': true,
        'تاب داشتن گاردان': false,
      },
      'images/p1images2/29.jpg'), //images

  Qusittionmodel(
      'بر روی جاده خیس ترمزی می کنید وسیله شما شروع به لغزش می کند اولین کاری که انجام می دهید چیست؟ ',
      //titels
      {
        'ترمز را کاملا آزاد می کنید': true, //quizes
        'به سرعت ترمز دستی را بکشید': false,
        'پای خود را با شدت بیشتری بر ترمز فشار دهید': false,
        'پای خود را بر روی کلاج بگذارید': false,
      },
      'images/p1images2/30.jpg'), //images
];
