import 'package:driving_licence_quiz/Datta/qustions.dart';

List<qustion> getQuiztionslist() {
  var firstquiz = qustion();

  firstquiz.quistionTitle =
      'در بزرگراه اتومبیل شما دچار نقص فنی میشود برای هشدار به وسائط نقلیه دیگر تابلوی احتیاط را در چه فاصله ای از اتومبیل خود قرار می دهید؟ ';
  firstquiz.imagenamenumber = 'images/1.jpg';
  firstquiz.anwserslist = [
    ' ',
    ' 120 متری',
    ' 150 متری',
    '  70 متری',
  ];
  firstquiz.corrctAnwsers = 3;
  firstquiz.help =
      '(اگر در جاده هستیم باید مثلث خطر را در فاصله ۷۰ متری بگذاریم و اگر در بزرگراه هستیم باید مثلث خطر را در فاصله ۱۵۰ متری بگذاریم (از سری سوالات پر تکرار آزمون آیین نامه اصلی۱۴۰۱) ';
////////////////////////////////////////////////////////////////

  var secquiz = qustion();

  secquiz.quistionTitle = 'در چند متر مانده به پیچ ها سبقت ممنوع است؟';
  secquiz.imagenamenumber = 'images/2.jpg';
  secquiz.anwserslist = [
    '100 متری',
    '50 متری',
    '150 متری',
    ' 60 متری',
  ];
  secquiz.corrctAnwsers = 2;
  secquiz.help =
      'از ۵۰ متر مانده به پیچ ها تا ۵۰ متر پس از آن یا در تقاطع راهها یا در تقاطع راه آهن، مگر آنکه به وسیله علایم، سبقت مجاز شناخته شده باشد، سبقت گرفتن ممنوع است.';
//////////////////////////////////////////////////////////////////////////
  var thriquiz = qustion();
  thriquiz.quistionTitle =
      'به عنوان یک کمک دهنده به یک مصدوم باید چه مواردی را در اولیت قرار داد؟ ';
  thriquiz.corrctAnwsers = 4;
  thriquiz.imagenamenumber = 'images/3.jpg';
  thriquiz.anwserslist = [
    ' ارزیابی موقعیت و در خواست کمک',
    'ارائه کمک های اولیه',
    ' امن کردن محل حادثه',
    '  همه موارد',
  ];
  thriquiz.help = 'صفحه ۱۹۰ کتاب آیین نامه راهنمایی و رانندگی';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var forth = qustion();
  forth.quistionTitle =
      ' کدامیک از موارد زیر در خصوص نقاط کور در وسایل نقلیه صحیح نمی باشد؟';
  forth.corrctAnwsers = 2;
  forth.imagenamenumber = 'images/4.jpg';
  forth.anwserslist = [
    ' با تنظیم دقیق آئینه ها می توان میزن نقاط کور را کاهش داد',
    'موتورسیکلت ها دارای نقاط کور نمی باشند.',
    ' حتی با تنظیم دقیق آئینه ها نمی توان نقاط کور را در خودروها حذف نمود.',
    'میزان وسعت نقاط کور در خودروهای سنگین بیشتر از خودروهای سبک است.',
  ];
  forth.help = ' موتورسیکلت ها دارای نقاط کور نمی باشند.';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var fifth = qustion();
  fifth.quistionTitle = 'کدام تابلو درباره عبور عابر پیاده هشدار می دهد؟';
  fifth.corrctAnwsers = 1;
  fifth.imagenamenumber = 'images/5.jpg';
  fifth.anwserslist = [
    'تابلوی شماره دو',
    'تابلوی شماره یک',
    'تابلوی شماره چهار',
    ' تابلوی شماره سه',
  ];
  fifth.help = '1';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var sixth = qustion();
  sixth.quistionTitle =
      'چرا موتور سواران نسبت به رانندگان اتومبیل آسیب پذیر ترند؟';
  sixth.corrctAnwsers = 2;
  sixth.imagenamenumber = 'images/6.jpg';
  sixth.anwserslist = [
    ' سرعت آنها از اتومبیل ها سریعتر است.',
    'تغییرات سطح راه بر روی آنها تاثیرات بیشتری دارد.',
    'نسبت به اتومبیل شتاب بیشتری میگیرند.',
    ' با سرعت بیشتری پیچ ها را طی میکنند.',
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var seventh = qustion();
  seventh.quistionTitle =
      'مقدار ولتاژ باتری در خودروهای معمول سواری چند ولت است؟';
  seventh.corrctAnwsers = 2;
  seventh.imagenamenumber = 'images/7.jpg';
  seventh.anwserslist = [
    '48 ولت',
    '12 ولت',
    '24 ولت',
    '6 ولت',
  ];
  seventh.help =
      'مقدار ولتاژ باتری در خودروهای معمول سواری ۱۲ ولت است. صفحه ۱۴۰ کتاب آیین نامه راهنمایی و رانندگی';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var eghith = qustion();
  eghith.quistionTitle = 'در چند متر مانده به تونل ها و پل ها سبقت ممنوع است؟';
  eghith.corrctAnwsers = 1;
  eghith.imagenamenumber = 'images/8.jpg';
  eghith.anwserslist = [
    '100 متری',
    '50 متری',
    '150متری',
    '70 متری',
  ];
  eghith.help =
      'از ۱۰۰ متر مانده به ورودی تونل ها و پل ها تا انتهای آنها، مگر آنکه به وسیله علایم، سبقت مجاز شناخسته شده باشد، سبقت گرفتن ممنوع است. صفحه ۵۰';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var nineth = qustion();
  nineth.quistionTitle = 'شکل بالا چه موردی را هشدار می دهد؟';
  nineth.corrctAnwsers = 2;
  nineth.imagenamenumber = 'images/9.jpg';
  nineth.anwserslist = [
    'در هنگام عبور از کنار گذر حق تقدم عبور با وسیله نقلیه است',
    'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید باید مراقب حرکت عابرین پیاده که در حال گذر می باشند بوده و به آنها اجازه عبور دهید.',
    'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید می توانید با احتیاط عبور کنید.',
    'هیچ کدام',
  ];
  nineth.help = 'صفحه ۸۹ کتاب آیین نامه راهنمایی و رانندگی';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var tenth = qustion();
  tenth.quistionTitle =
      'کدامیک از موارد زیرنشان دهنده بوجود آمدن حالت خستگی و خواب آلودگی در حین رانندگی است؟';
  tenth.corrctAnwsers = 4;
  tenth.imagenamenumber = 'images/10.jpg';
  tenth.anwserslist = [
    ' احساس سنگینی در پلکها - کنترل آگاهانه خودرو - عدم توانایی کنترل خودرو',
    ' پلک زدن - عدم کنترل خودرو',
    ' افزایش سرعت واکنش نسبت به شرایط - احساس سنگینی در پلکها',
    'احساس سنگینی پلکها - عدم کنترل آگاهانه سرعت خودرو - عدم تمرکز روی رانندگی',
  ];
  tenth.help =
      ' احساس سنگینی در پلکها - کنترل آگاهانه خودرو - عدم توانایی کنترل خودرو';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var eleven = qustion();
  eleven.quistionTitle = 'استفاده از بوق در کدامیک از موارد زیر مجاز است؟';
  eleven.corrctAnwsers = 1;
  eleven.imagenamenumber = 'images/11.jpg';
  eleven.anwserslist = [
    'اطلاع و آگاه سازی سایر کاربران راه و جلوگیری از بروز سانحه و خطر',
    ' اطلاع و آگاه سازی برای ادای احترام به سایر کاربران راه',
    'برای کاهش شدت تصادفات',
    '  برای کاهش شدت تصادفات و آگاهی سایر کاربران  و مراسم خاص مثل عروسی ',
  ];
  eleven.help = '1';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twilve = qustion();
  twilve.quistionTitle =
      'میزان سرعت مجاز و محدودیت سرعت در جاده ها و خیابانها به چه صورت مشخص می شود؟';
  twilve.corrctAnwsers = 4;
  twilve.imagenamenumber = 'images/12.jpg';
  twilve.anwserslist = [
    ' با توجه به مواردی که GPS خودرو نشان می دهد.',
    ' با توجه به دستور پلیس در جاده ها مشخص می شود.',
    'سرعت مجاز بسته به نوع خودرو و مدل آن قابل تغییر است.',
    'با توجه به تابلوهای نصب شده و آیین نامه راهنمایی و رانندگی.',
  ];
  twilve.help = '4';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var thirteen = qustion();
  thirteen.quistionTitle =
      'در هنگام ایمن کردن صحنه تصادف انجام کدامیک از موارد زیر صحیح نمی باشد؟';
  thirteen.corrctAnwsers = 3;
  thirteen.imagenamenumber = 'images/13.jpg';
  thirteen.anwserslist = [
    ' استفاده از تابلو اعلان خطر در فاصله مناسب از تصادف',
    'پارک کردن خودروی خود در فاصله مناسب از صحنه حادثه',
    'به خطر انداختن خود برای نجات دیگران',
    ' استفاده از وسایل روشنایی برای اعلان خطر در شب',
  ];
  thirteen.help = '3';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var forteen = qustion();
  forteen.quistionTitle =
      ' کدامیک از موارد زیر در خصوص رانندگی در شب صحیح است؟ ';
  forteen.corrctAnwsers = 4;
  forteen.imagenamenumber = 'images/14.jpg';
  forteen.anwserslist = [
    ' با افزایش سرعت در شبها می توان کاهش دید را جبران کرد',
    'میزان تصادفات در شب کاهش می یابد',
    'در شب زمان کمتری طول می کشد تا راننده موانع موجود را ببیند',
    'محدوده دید راننده در شب کاهش می یابد',
  ];
  forteen.help = '4';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var fiftheen = qustion();
  fiftheen.quistionTitle = 'دور زدن از روی خط پر و یا یک خط ممتد …';
  fiftheen.corrctAnwsers = 1;
  fiftheen.imagenamenumber = 'images/15.jpg';
  fiftheen.anwserslist = [
    'ممنوع است',
    'از 150 متری ورودی تونل ها',
    'از 100 متری مانده به پیچ ها',
    ' از 100 متری پس از پیچ ها',
  ];
  fiftheen.help = '1';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var sixteen = qustion();
  sixteen.quistionTitle =
      'در چه فاصله ای از اطراف چراغهای راهنمایی و رانندگی توقف ممنوع می باشد؟';
  sixteen.corrctAnwsers = 1;
  sixteen.imagenamenumber = 'images/16.jpg';
  sixteen.anwserslist = [
    '15 متری',
    ' 25 متری',
    '35 متری',
    '5 متری',
  ];
  sixteen.help =
      'در فاصله ۱۵ متری اطراف چراغ های راهنمایی و رانندگی و یا محل هایی که توقف وسایل نقلیه مانع دید علایم راهنمایی و رانندگی بشود، توقف ممنوع است.صفحه ۵۸ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var seventeen = qustion();
  seventeen.quistionTitle =
      ' چرا شکسته و کثیف بودن شیشه های خودرو می تواند خطرناک باشد؟';
  seventeen.corrctAnwsers = 3;
  seventeen.imagenamenumber = 'images/17.jpg';
  seventeen.anwserslist = [
    'چون باعث کاهش انعکاس نور می شود',
    'خطری ندارد',
    'چون باعث کاهش دید می شود',
    ' چون باعث افزایش انعکاس نور می شود',
  ];
  seventeen.help = '3';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var eighteen = qustion();
  eighteen.quistionTitle =
      'آیا رانندگان وسایل نقلیه امدادی در هنگام ماموریت مجاز به عبور از محل ممنوع می باشند؟';
  eighteen.corrctAnwsers = 1;
  eighteen.imagenamenumber = 'images/18.jpg';
  eighteen.anwserslist = [
    'به علت خطرات موجود نمی توانند عبور ممنوع بروند',
    'بستگی به شرایط دارد',
    'در هر شرایطی مجاز هستند',
    'در صورتیکه موجب تصادف نشوند',
  ];

  eighteen.help = '1';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var nintheen = qustion();
  nintheen.quistionTitle =
      'حداکثر سرعت در جاده های اصلی برون شهری چند کیلومتر است؟';
  nintheen.corrctAnwsers = 1;
  nintheen.imagenamenumber = 'images/19.jpg';
  nintheen.anwserslist = [
    'روزها 95 کیلومتر ، شب 85 کیلومتر',
    ' روزها 90 کیلومتر ، شب 85 کیلومتر',
    'در روزها 85 کیلومتر ، شب 90 کیلومتر',
    'روزها 110 کیلومتر ، شب 90 کیلومتر',
  ];
  nintheen.help =
      'حداکثر میزان سرعت مجاز در جاده های اصلی برای انواع وسایل نقلیه، روزها ۹۵ و شب ها ۸۵ کیلومتر در ساعت می باشد.صفحه ۴۸ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinty = qustion();
  twinty.quistionTitle = 'نام نقاط قرمز رنگ مشخص شده در تصویر بالا چیست؟';
  twinty.corrctAnwsers = 2;
  twinty.imagenamenumber = 'images/20.jpg';
  twinty.anwserslist = [
    'نقطه کور ماشین سنگین',
    'محدوده نقاط کور در خودروهای سنگین',
    'نقاط خطرناک',
    'همه موارد',
  ];
  twinty.help =
      'محدوده نقاط کور در خودروهای سنگین. (محدوده های قرمز رنگ)صفحه ۹۲ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyone = qustion();
  twinyone.quistionTitle =
      ' چه موقع میتوانید به صورت دنده عقب از یک خیابان فرعی به خیابان اصلی وارد شوید؟';
  twinyone.corrctAnwsers = 4;
  twinyone.imagenamenumber = 'images/21.jpg';
  twinyone.anwserslist = [
    'در همه مواقع',
    'تنها اگر هردو خیابان خلوت باشد.',
    ' تنها اگر خیابان اصلی دارای ترافیک نباشد.',
    'هیچ موقع',
  ];
  twinyone.help = '4';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twintytwo = qustion();
  twintytwo.quistionTitle =
      'وقتی در خط عبوری که حرکت می کنید اتومبیل ها توقف کرده باشند و راه مسدود شده باشد چه کار باید کرد؟ ';
  twintytwo.corrctAnwsers = 2;
  twintytwo.imagenamenumber = 'images/22.jpg';
  twintytwo.anwserslist = [
    'بوق ممتدد',
    'به ترافیک جهت مقابل اجازه عبور میدهید',
    'شتاب بگیرید که زودتر از آنها عبور کنید',
    'شتاب بگیرید که زودتر از آنها عبور کنید',
  ];
  twinyone.help = '2';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinythree = qustion();
  twinythree.quistionTitle =
      ' در یک منطقه مسکونی و شهری در حال حرکت هستید، به یک سرعت گیر نزدیک میشوید .چکار می کنید؟';
  twinythree.corrctAnwsers = 2;
  twinythree.imagenamenumber = 'images/23.jpg';
  twinythree.anwserslist = [
    'با همان سرعت به راه خود ادامه می دهید',
    ' با احتیاط سرعت را کاهش می دهید',
    'فرصت ندهید عابرین از خیابان عبور کنند',
    'از قسمت چپ جاده عبور می کنید',
  ];
  twinythree.help = '2';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyfour = qustion();
  twinyfour.quistionTitle = 'در میدان ها حق تقدم عبور با کدام وسیله است؟ ';
  twinyfour.corrctAnwsers = 3;
  twinyfour.imagenamenumber = 'images/24.jpg';
  twinyfour.anwserslist = [
    ' وسیله ای اول وارد می شود',
    ' وسیله ای که زودتر وارد میدان شده است',
    'وسیله ای که در درون میدان در حال حرکت است',
    'هیچکدام',
  ];
  twinyfour.help = '3';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyfive = qustion();
  twinyfive.quistionTitle =
      'در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند وارد خیابان مجاور شوند حق تقدم با کدام است';
  twinyfive.corrctAnwsers = 2;
  twinyfive.imagenamenumber = 'images/25.jpg';
  twinyfive.anwserslist = [
    ' وسیله ای که به چپ گردش میکند',
    ' وسیله ای که به راست گردش میکند',
    'منتظر میمانند تا پلیس راهنمایی بیاید',
    'هیچکدام',
  ];
  twinyfive.help =
      'در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند با هم وارد خیابان مجاور واحدی شوند، حق تقدم عبور با وسیله ای است که به سمت راست گردش می کند. صفحه ۱۰۵ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinysix = qustion();
  twinysix.quistionTitle =
      'چراغ های جلو وسایل نقلیه ای که در شانه راه ها ( به استثنای آزاد راه ها و بزرگراه ها) توقف می نمایند بادیدن حرکت وسایل نقلیه ای که از مقابل در حرکتند باید خاموش شود و برای تشخیص وجود و ابعاد وسیله نقلیه، چراغ های ……… و ……… را روشن نمایند.';
  twinysix.corrctAnwsers = 1;
  twinysix.imagenamenumber = 'images/26.jpg';
  twinysix.anwserslist = [
    ' کوچک - جانبی',
    'بزرگ - جانبی',
    'کوچک - راهنما',
    ' کوچک - بزرگ',
  ];
  twinysix.help =
      'از سری سوالات پرتکرار آزمون آیین نامه اصلی سال۱۴۰۰ – پاسخ – کوچک و جانبی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyseven = qustion();
  twinyseven.quistionTitle =
      'حداکثر سرعت مجازبرای سواری و وانت بارها دربزرگراهها برون شهری چقدر است؟';
  twinyseven.corrctAnwsers = 1;
  twinyseven.imagenamenumber = 'images/27.jpg';
  twinyseven.anwserslist = [
    ' 110 کیلومتر بر ساعت',
    ' 120 کیلومتر بر ساعت',
    '95 کیلومتر بر ساعت',
    ' 100 کیلومتر بر ساعت',
  ];
  twinyseven.help =
      'در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند با هم وارد خیابان مجاور واحدی شوند، حق تقدم عبور با وسیله ای است که به سمت راست گردش می کند.  48p';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyeghit = qustion();
  twinyeghit.quistionTitle =
      'در راههای مسطح که دو طرف راه منتهی به کوه و پرتگاه می باشد حق تقدم عبور با کدامیک است؟ ';
  twinyeghit.corrctAnwsers = 2;
  twinyeghit.imagenamenumber = 'images/28.jpg';
  twinyeghit.anwserslist = [
    ' وسیله ای که سمت کوه قرار دارد',
    'وسیله ای که سمت پرتگاه قراردارد',
    'هر دو وسیله حق تقدم عبور دارند',
    'هیچکدام',
  ];
  twinyeghit.help =
      'در راههای مسطح که دو طرف راه منتهی به کوه و پرتگاه میباشد حق تقدم عبور با وسایل نقلیه ای است که در طرف پرتگاه قرار دارند.فحه ۵۳ کتاب آیین نامه راهنمایی و رانندگی';

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var twinyninie = qustion();
  twinyninie.quistionTitle = ' در خیابان‌ها و جاده‌هایی که نور کافی وجود دارد';
  twinyninie.corrctAnwsers = 1;
  twinyninie.imagenamenumber = 'images/29.jpg';
  twinyninie.anwserslist = [
    ' باید تنها از چراغ‌ های جانبی جلو و عقب استفاده نمود',
    'باید از نوربالا استفاده نمود',
    ' باید تنها از نور پایین استفاده نمود',
    ' تمام چراغ‌ ها را باید خاموش نمود',
  ];
  twinyninie.help =
      'در خیابان ها و جاده هایی که نور کافی وجود دارد باید تنها از چراغ های جانبی جلو و عقب و در صورت خرابی ناگهانی چراغ های جانبی جلو از چراغ عبور (نور پایین) استفاده شود.فحه ۵۳ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  var thirty = qustion();
  thirty.quistionTitle = ' در محل توقف(پارک) کنار خیابان حق تقدم با کیست؟';
  thirty.corrctAnwsers = 1;
  thirty.imagenamenumber = 'images/30.jpg';
  thirty.anwserslist = [
    'وسیله ای که ضمن حرکت با دنده عقب مشغول پارک کردن است',
    'هر دو حق تقدم دارند',
    'هیچکدام',
    'وسیله نقلیه ای که بصورت مستقیم وارد پارک می شود',
  ];
  thirty.help =
      'در محل توقف ( پارک) کنار خیابان حق تقدم با وسیله ای است که ضمن حرکت به عقب مشغول توقف یا پارک کردن است.صفحه ۵۲ کتاب آیین نامه راهنمایی و رانندگی';
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// /////////////////////////////////////////////////////////////
//   Qusittionmodel(
//       '', //titels
//       {
//         '': false, //quizes
//         '': false,
//         '': false,
//         '': true,
//       },
//       ''), //images
/////////////////////////////////////////////////////////////

  return [
    firstquiz,
    secquiz,
    thriquiz,
    forth,
    fifth,
    sixth,
    seventh,
    eghith,
    nineth,
    tenth,
    eleven,
    twilve,
    thirteen,
    forteen,
    fiftheen,
    sixteen,
    seventeen,
    eighteen,
    nintheen,
    twinty,
    twinyone,
    twintytwo,
    twinythree,
    twinyfour,
    twinyfive,
    twinysix,
    twinyseven,
    twinyeghit,
    twinyninie,
    thirty
  ];
}
