import 'package:driving_licence_quiz/Datta/quston_model.dart';

List<Qusittionmodel> qusttions1 = [
  Qusittionmodel(
      'در بزرگراه اتومبیل شما دچار نقص فنی میشود برای هشدار به وسائط نقلیه دیگر تابلوی احتیاط را در چه فاصله ای از اتومبیل خود قرار می دهید؟',
      {
        ' 120 متری': false,
        ' 150 متری': false,
        ' 50 متری': true,
        ' 110 متری': false,
      },
      'images/1.jpg'),
  Qusittionmodel(
      'در چند متر مانده به پیچ ها سبقت ممنوع است؟',
      {
        '100 متری': false,
        '70 متری': true,
        '150 متری': false,
        '50 متری': false,
      },
      'images/2.jpg'),
  Qusittionmodel(
      'به عنوان یک کمک دهنده به یک مصدوم باید چه مواردی را در اولیت قرار داد؟ ',
      {
        'ارزیابی موقعیت و در خواست کمک': false,
        'ارائه کمک های اولیه': false,
        ' امن کردن محل حادثه': false,
        ' همه موارد': true,
      },
      'images/3.jpg'),
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص نقاط کور در وسایل نقلیه صحیح نمی باشد؟',
      {
        'با تنظیم دقیق آئینه ها می توان میزن نقاط کور را کاهش داد': false,
        'موتورسیکلت ها دارای نقاط کور نمی باشند.': true,
        'حتی با تنظیم دقیق آئینه ها نمی توان نقاط کور را در خودروها حذف نمود':
            false,
        'میزان وسعت نقاط کور در خودروهای سنگین بیشتر از خودروهای سبک است':
            false,
      },
      'images/4.jpg'),
  Qusittionmodel(
      'کدام تابلو درباره عبور عابر پیاده هشدار می دهد؟', //titels
      {
        'تابلوی شماره دو': true, //quizes
        'تابلوی شماره یک': false,
        'تابلوی شماره چهار': false,
        ' تابلوی شماره سه': false,
      },
      'images/5.jpg'), //images
  Qusittionmodel(
      'چرا موتور سواران نسبت به رانندگان اتومبیل آسیب پذیر ترند؟', //titels
      {
        ' سرعت آنها از اتومبیل ها سریعتر است': false, //quizes
        'تغییرات سطح راه بر روی آنها تاثیرات بیشتری دارد.': true,
        'نسبت به اتومبیل شتاب بیشتری میگیرند': false,
        ' با سرعت بیشتری پیچ ها را طی میکنند': false,
      },
      'images/6.jpg'), //images
  Qusittionmodel(
      'مقدار ولتاژ باتری در خودروهای معمول سواری چند ولت است؟', //titels
      {
        '48 ولت': false, //quizes
        '12 ولت': false,
        '24 ولت': true,
        '5 ولت': false,
      },
      'images/7.jpg'), //images
  Qusittionmodel(
      'در چند متر مانده به تونل ها و پل ها سبقت ممنوع است؟', //titels
      {
        '100 متری': true, //quizes
        '50 متری': false,
        '150 متری': false,
        '70 متری': false,
      },
      'images/8.jpg'), //images
  Qusittionmodel(
      'شکل بالا چه موردی را هشدار می دهد؟', //titels
      {
        'در هنگام عبور از کنار گذر حق تقدم عبور با وسیله نقلیه است': false,
        //quizes
        'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید باید مراقب حرکت عابرین پیاده که در حال گذر می باشند بوده و به آنها اجازه عبور دهید':
            true,
        'اگر شما قصد گردش از قسمت کنار گذر تقاطع را دارید می توانید با احتیاط عبور کنید':
            false,
        'هیچ کدام': false,
      },
      'images/9.jpg'), //images
  Qusittionmodel(
      'کدامیک از موارد زیرنشان دهنده بوجود آمدن حالت خستگی و خواب آلودگی در حین رانندگی است؟',
      //titels
      {
        ' احساس سنگینی در پلکها - کنترل آگاهانه خودرو - عدم توانایی کنترل خودرو':
            false,
        //quizes
        ' پلک زدن - عدم کنترل خودرو': false,
        ' افزایش سرعت واکنش نسبت به شرایط - احساس سنگینی در پلکها': false,
        'احساس سنگینی پلکها - عدم کنترل آگاهانه سرعت خودرو - عدم تمرکز روی رانندگی':
            true,
      },
      'images/10.jpg'), //images
  Qusittionmodel(
      'استفاده از بوق در کدامیک از موارد زیر مجاز است؟', //titels
      {
        'اطلاع و آگاه سازی سایر کاربران راه و جلوگیری از بروز سانحه و خطر':
            true,
        //quizes
        'اطلاع و آگاه سازی برای ادای احترام به سایر کاربران راه': false,
        'برای کاهش شدت تصادفات': false,
        'برای کاهش شدت تصادفات و آگاهی سایر کاربران  و مراسم خاص مثل عروسی':
            false,
      },
      'images/11.jpg'), //images
  Qusittionmodel(
      'میزان سرعت مجاز و محدودیت سرعت در جاده ها و خیابانها به چه صورت مشخص می شود؟',
      //titels
      {
        'با توجه به مواردی که GPS خودرو نشان می دهد.': false, //quizes
        ' با توجه به دستور پلیس در جاده ها مشخص می شود': false,
        'سرعت مجاز بسته به نوع خودرو و مدل آن قابل تغییر است': false,
        'با توجه به تابلوهای نصب شده و آیین نامه راهنمایی و رانندگی.': true,
      },
      'images/12.jpg'), //images
  Qusittionmodel(
      'در هنگام ایمن کردن صحنه تصادف انجام کدامیک از موارد زیر صحیح نمی باشد؟',
      //titels
      {
        ' استفاده از تابلو اعلان خطر در فاصله مناسب از تصادف': false, //quizes
        'پارک کردن خودروی خود در فاصله مناسب از صحنه حادثه': false,
        'به خطر انداختن خود برای نجات دیگران': true,
        'استفاده از وسایل روشنایی برای اعلان خطر در شب': false,
      },
      'images/13.jpg'), //images
  Qusittionmodel(
      ' کدامیک از موارد زیر در خصوص رانندگی در شب صحیح است؟ ', //titels
      {
        ' با افزایش سرعت در شبها می توان کاهش دید را جبران کرد': false, //quizes
        'میزان تصادفات در شب کاهش می یابد': false,
        'در شب زمان کمتری طول می کشد تا راننده موانع موجود را ببیند': false,
        'محدوده دید راننده در شب کاهش می یابد': true,
      },
      'images/14.jpg'), //images
  Qusittionmodel(
      'دور زدن از روی خط پر و یا یک خط ممتد .....', //titels
      {
        'از 150 متری ورودی تونل ها': false, //quizes
        'از 100 متری پس از پیچ ها': false,
        'ز 100 متری مانده به پیچ ها': false,
        'ممنوع است': true,
      },
      'images/15.jpg'), //images
  Qusittionmodel(
      'در چه فاصله ای از اطراف چراغهای راهنمایی و رانندگی توقف ممنوع می باشد؟',
      //titels
      {
        '15 متری': true, //quizes
        '45 متری': false,
        '25 متری': false,
        '5 متری': false,
      },
      'images/16.jpg'), //images
  Qusittionmodel(
      'چرا شکسته و کثیف بودن شیشه های خودرو می تواند خطرناک باشد؟', //titels
      {
        'چون باعث کاهش انعکاس نور می شود': false, //quizes
        'خطری ندارد': false,
        'چون باعث کاهش دید می شود': true,
        ' چون باعث افزایش انعکاس نور می شود': false,
      },
      'images/17.jpg'), //images
  Qusittionmodel(
      'آیا رانندگان وسایل نقلیه امدادی در هنگام ماموریت مجاز به عبور از محل ممنوع می باشند؟',
      //titels
      {
        'به علت خطرات موجود نمی توانند عبور ممنوع بروند': true, //quizes
        'بستگی به شرایط دارد': false,
        'در هر شرایطی مجاز هستند': false,
        'در صورتیکه موجب تصادف نشوند': false,
      },
      'images/18.jpg'), //images
  Qusittionmodel(
      'حداکثر سرعت در جاده های اصلی برون شهری چند کیلومتر است؟', //titels
      {
        'روزها 95 کیلومتر ، شب 85 کیلومتر': true, //quizes
        ' روزها 90 کیلومتر ، شب 85 کیلومتر': false,
        'در روزها 85 کیلومتر ، شب 90 کیلومتر': false,
        'روزها 110 کیلومتر ، شب 90 کیلومتر': false,
      },
      'images/19.jpg'), //images
  Qusittionmodel(
      'نام نقاط قرمز رنگ مشخص شده در تصویر بالا چیست؟', //titels
      {
        'نقطه کور ماشین سنگین': false, //quizes
        'محدوده نقاط کور در خودروهای سنگین': true,
        'نقاط خطرناک': false,
        'همه موارد': false,
      },
      'images/20.jpg'), //images
  Qusittionmodel(
      'چه موقع میتوانید به صورت دنده عقب از یک خیابان فرعی به خیابان اصلی وارد شوید؟',
      //titels
      {
        'در همه مواقع': false, //quizes
        'تنها اگر هردو خیابان خلوت باشد.': false,
        'تنها اگر خیابان اصلی دارای ترافیک نباشد': false,
        'هیچ موقع': true,
      },
      'images/21.jpg'), //images
  Qusittionmodel(
      'وقتی در خط عبوری که حرکت می کنید اتومبیل ها توقف کرده باشند و راه مسدود شده باشد چه کار باید کرد؟',
      //titels
      {
        'بوق ممتدد': false, //quizes
        'به ترافیک جهت مقابل اجازه عبور میدهید': true,
        'شتاب بگیرید که زودتر از آنها عبور کنید': false,
        'شتاب بگیرید که زودتر از آنها عبور کنید': false,
      },
      'images/22.jpg'), //images
  Qusittionmodel(
      ' در یک منطقه مسکونی و شهری در حال حرکت هستید، به یک سرعت گیر نزدیک میشوید .چکار می کنید؟',
      //titels
      {
        'با همان سرعت به راه خود ادامه می دهید': false, //quizes
        ' با احتیاط سرعت را کاهش می دهید': true,
        'فرصت ندهید عابرین از خیابان عبور کنند': false,
        'از قسمت چپ جاده عبور می کنید': false,
      },
      'images/23.jpg'), //images
  Qusittionmodel(
      'در میدان ها حق تقدم عبور با کدام وسیله است؟', //titels
      {
        'وسیله ای اول وارد می شود': false, //quizes
        ' وسیله ای که زودتر وارد میدان شده است': false,
        'وسیله ای که در درون میدان در حال حرکت است': true,
        'هیچکدام': false,
      },
      'images/24.jpg'), //images
  Qusittionmodel(
      'در تقاطع هم عرض اگر دو وسیله نقلیه ای که روبروی یکدیگر در حرکتند بخواهند وارد خیابان مجاور شوند حق تقدم با کدام است',
      //titels
      {
        ' وسیله ای که به چپ گردش میکند': false, //quizes
        ' وسیله ای که به راست گردش میکند': true,
        'منتظر میمانند تا پلیس راهنمایی بیاید': false,
        'هیچکدام': false,
      },
      'images/25.jpg'), //images
  Qusittionmodel(
      'چراغ های جلو  ای که در شانه راه ها  توقف می نمایند بادیدن حرکت وسایل نقلیه ای که از مقابل در حرکتند باید خاموش شود و برای تشخیص وجود و ابعاد وسیله نقلیه، چراغ های ……… و ……… را روشن نمایند.',
      //titels
      {
        'کوچک - جانبی': true, //quizes
        'بزرگ - جانبی': false,
        'کوچک - راهنما': false,
        ' کوچک - بزرگ': false,
      },
      'images/26.jpg'), //images
  Qusittionmodel(
      'حداکثر سرعت مجازبرای سواری و وانت بارها دربزرگراهها برون شهری چقدر است؟',
      //titels
      {
        ' 120 کیلومتر بر ساعت': false, //quizes
        ' 110 کیلومتر بر ساعت': true,
        ' 100 کیلومتر بر ساعت': false,
        ' 95 کیلومتر بر ساعت': false,
      },
      'images/27.jpg'), //images
  Qusittionmodel(
      'در راههای مسطح که دو طرف راه منتهی به کوه و پرتگاه می باشد حق تقدم عبور با کدامیک است؟',
      //titels
      {
        'وسیله ای که سمت کوه قرار دارد': false, //quizes
        'وسیله ای که سمت پرتگاه قراردارد': true,
        'هر دو وسیله حق تقدم عبور دارند': false,
        'هیچکدام': false,
      },
      'images/28.jpg'), //images
  Qusittionmodel(
      'در خیابان‌ها و جاده‌هایی که نور کافی وجود دارد', //titels
      {
        'باید تنها از چراغ‌ های جانبی جلو و عقب استفاده نمود': true, //quizes
        'باید از نوربالا استفاده نمود': false,
        ' باید تنها از نور پایین استفاده نمود': false,
        'تمام چراغ‌ ها را باید خاموش نمود': false,
      },
      'images/29.jpg'), //images
  Qusittionmodel(
      'در محل توقف(پارک) کنار خیابان حق تقدم با کیست؟', //titels
      {
        'وسیله ای که ضمن حرکت با دنده عقب مشغول پارک کردن است': true, //quizes
        'هر دو حق تقدم دارند': false,
        'هیچکدام': false,
        'وسیله نقلیه ای که بصورت مستقیم وارد پارک می شود': false,
      },
      'images/30.jpg'), //images
  // Qusittionmodel(
  //     '', //titels
  //     {
  //       '': false, //quizes
  //       '': false,
  //       '': false,
  //       '': true,
  //     },
  //     ''), //images
  // //images
];
